{"pageProps":{"pressRelease":{"title":"EQ Inc. Reports Profitable Fourth Quarter and 2018 Year End Financial Results","slug":"eq-inc-reports-profitable-fourth-quarter-and-2018","excerpt":"EQ Inc. announced its financial results today for the full year and fourth quarter ended December 31 2018.","author":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2019-04-30T00:00-04:00","categories":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Toronto, ON (April 30, 2019)","nodeType":"text"},{"data":{},"marks":[],"value":" - EQ Inc. (TSXV: EQ) (“EQ Works”, “EQ” or the “Company”), North America’s leader in location behaviour data and intelligence, announced its financial results today for the full year and fourth quarter ended December 31 2018.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Revenue for the fourth quarter of 2018 was $2.3 million, an increase of 62% over the third quarter of 2018 and an increase of 39% from the same period a year ago. Revenue for the year increased to $5.9 million, an increase of 6% from the $5.5 million recorded in the previous year.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The Company generated a positive adjusted EBITDA for the fourth quarter, an improvement of 114% over the third quarter of 2018, as many of its earlier investments in the technology platform began to perform. The adjusted EBITDA loss for the year was $1.1 million, an increase of $0.6 million from the same period a year ago resulting primarily from significant investments in proprietary systems and platforms that collect and utilize data to help brands better understand and engage with their audience. These investments contributed to the overall increase in employee compensation and operating expenses.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Highlights for the year and fourth quarter ended December 31, 2018","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Increased quarterly revenue by 39% when compared to the fourth quarter of 2017","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Annual revenue increased by 6% compared to the same period a year ago","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Completed the acquisition of Tapped Mobile to further strengthen EQ’s sales, data and brand profile","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Increased data revenue for the sixth sequential quarter resulting in 388% growth compared to the same period a year ago and 61% sequentially","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Completed two equity financings for a total of $1.6 million","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Added forty new high-value clients during the year ended December 2018","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Established Blockchain partnership through a strategic relationship with Kochava’s XCHNG Platform","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Reduced outstanding debt and interest obligations by approximately $1.9 million","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"}],"nodeType":"unordered-list"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Non-IFRS Financial Measures ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":" ","nodeType":"text"},{"data":{},"marks":[],"value":"We measure the success of our strategies and performance based on Adjusted EBITDA, which is outlined and reconciled with net income (loss) in the section entitled “Reconciliation of Net Loss for the period to Adjusted EBITDA” in the MD&A. The Company defines Adjusted EBITDA as net income (loss) from operations before; (a) depreciation of property and equipment and amortization of intangible assets, (b) share-based payments, (c) transaction costs acquisition (d) deferred tax recovery(e) gain on extension of loans and borrowings (f) finance income and costs, net,. Management uses Adjusted EBITDA as a measure of the Company's operating performance because it provides information related to the Company's ability to provide operating cash flows for working capital requirements, capital expenditures, and potential acquisitions. The Company also believes that analysts and investors use Adjusted EBITDA as a supplemental measure to evaluate the overall operating performance of companies in its industry.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The non-IFRS financial measure is used in addition to and in conjunction with results presented in the Company’s  consolidated financial statements prepared in accordance with IFRS and should not be relied upon to the exclusion of IFRS financial measures. Management strongly encourages investors to review the Company's consolidated financial statements in their entirety and to not rely on any single financial measure. Because non-IFRS financial measures are not standardized, it may not be possible to compare these financial measures with other companies' non-IFRS financial measures having the same or similar names. In addition, the Company expects to continue to incur expenses similar to the non-IFRS adjustments described above, and exclusion of these items from the Company's non-IFRS measures should not be construed as an inference that these costs are unusual, infrequent or non-recurring.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The table below reconciles net loss from operations and Adjusted EBITDA for the periods presented:","nodeType":"text"}],"nodeType":"paragraph"},{"data":{"target":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"75uFcJMPpLnwHflBhW83Mr","type":"Asset","createdAt":"2020-09-03T16:14:55.829Z","updatedAt":"2020-09-03T18:34:06.028Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":2,"locale":"en-US"},"fields":{"title":"Financials - 2018 Q4","description":"Financials - 2018 Q4","file":{"url":"//images.ctfassets.net/nph7if1oawhd/75uFcJMPpLnwHflBhW83Mr/649ed8fd968a80c8adf679ee0bab46f6/4thqtr2018chart.jpg","details":{"size":72262,"image":{"width":1013,"height":464}},"fileName":"4thqtr2018chart.jpg","contentType":"image/jpeg"}}}},"content":[],"nodeType":"embedded-asset-block"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"About EQ Works","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Works (www.eqworks.com) provides a smarter way to target customers. Using first-party, location-based behaviour signals, advanced data analytics, and proprietary software, EQ creates and targets customized, performance-boosting audience segments. Proprietary algorithms and data generate attribution models that connect consumer behavior in the physical world to consumer behavior in the digital world, solving complex challenges for brands and agencies.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[],"nodeType":"hr"},{"data":{},"content":[{"data":{},"marks":[{"type":"italic"}],"value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":" ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Forward-Looking Statements","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Certain statements contained in this press release constitute “forward-looking statements”. All statements other than statements of historical fact contained in this press release, including, without limitation, those regarding the Company’s future financial position and results of operations, strategy, plans, objectives, goals and targets, and any statements preceded by, followed by or that include the words “believe”, “expect”, “aim”, “intend”, “plan”, “continue”, “will”, “may”, “would”, “anticipate”, “estimate”, “forecast”, “predict”, “project”, “seek”, “should” or similar expressions or the negative thereof, are forward-looking statements. These statements are not historical facts but instead represent only the Company’s expectations, estimates and projections regarding future events. These statements are not guarantees of future performance and involve assumptions, risks and uncertainties that are difficult to predict. Therefore, actual results may differ materially from what is expressed, implied or forecasted in such forward-looking statements. Additional factors that could cause actual results, performance or achievements to differ materially include, but are not limited to the risk factors discussed in the Company’s MD&A for the three months and year ended December 31, 2018. Management provides forward-looking statements because it believes they provide useful information to investors when considering their investment objectives and cautions investors not to place undue reliance on forward-looking information. Consequently, all of the forward-looking statements made in this press release are qualified by these cautionary statements and other cautionary statements or factors contained herein, and there can be no assurance that the actual results or developments will be realized or, even if substantially realized, that they will have the expected consequences to, or effects on, the Company. These forward-looking statements are made as of the date of this press release and the Company assumes no obligation to update or revise them to reflect subsequent information, events or circumstances or otherwise, except as required by law.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"For more information, please contact:","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"EQ Inc. ","nodeType":"text"},{"data":{},"marks":[],"value":"\n1235 Bay Street, Suite 401| Toronto, Ontario |M5R 3K4\n","nodeType":"text"},{"data":{"uri":"mailto:press@eqworks.com"},"content":[{"data":{},"marks":[],"value":"press@eqworks.com","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":"\nwww.eqworks.com","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}}},"__N_SSG":true}