{"pageProps":{"pressRelease":{"title":"EQ Inc. Reports First Quarter Financial Results","slug":"eq-inc-reports-2020-first-quarter-financial","excerpt":"EQ Inc. announced its financial results today for the first quarter ended March 31, 2020.","author":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2020-05-29T00:00-04:00","categories":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"TORONTO, ON (May 29, 2020) -","nodeType":"text"},{"data":{},"marks":[],"value":" EQ Inc. (TSXV: EQ) (“EQ Works” or the “Company”), a leader in geospatial data and intelligence, announced its financial results today for the first quarter ended March 31, 2020.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Revenue for the quarter increased to $2.2 million, an improvement of over 56% from the $1.4 million recorded in same period a year ago. Data revenue grew for the 5th consecutive quarter, up 112% compared to the same period a year ago, as demand continued to grow for the proprietary data assets, machine learning and AI tools that comprise the EQ Works’ technology platforms. The adjusted EBITDA loss for the quarter was approximately $0.4 million as the Company continued to invest in its’ growth, including unique data assets, enhanced proprietary geospatial platforms and various infrastructure initiatives.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Highlights for the First Quarter ended March 31, 2020","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"56% increase in revenue compared to the first quarter of 2019","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"112% increase in data revenue compared to the same period last year","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"5th consecutive quarter of growth in data revenue","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Added 18 new clients including 2 new data license agreements","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Acquired Juice Mobile to further strengthen EQ’s data assets, marketing relationships and U.S. client base","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Consulted on various Contact Tracing programs, authored a technical whitepaper, developed an open SDK for a Contact Tracing application and formed relationships and potential partnerships with a variety of public and private organizations","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Seamlessly transitioned to a work-from-home structure to ensure the health and safety of our team and continued to service our partners and customers","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"}],"nodeType":"unordered-list"},{"data":{},"content":[{"data":{},"marks":[],"value":"\"In what is typically a slow quarter for our industry, we are extremely pleased to show continued traction in our data business and a 56% increase in our total revenue” said Geoffrey Rotstein, President and CEO of EQ Works. “I am extremely proud of the work that our team has done on Contract Tracing over the past few months. We are fortunate to have the expertise to help with initiatives that can benefit the country and save lives and our team has done tremendous work. As with all other industries across Canada, the last few months have been challenging and our media business has had campaigns paused or reduced while clients adjust to the impact of the COVID-19. We have taken several measures to address these changes including a review of all unnecessary expenses, a concerted effort to ensure investments are focussed only in areas of growth, and the furloughing of certain employees. Although we are starting to see clients resume their previously paused campaigns, we continue to monitor closely to best protect our financial position and our investments.”","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The Company also held its annual general meeting on May 21, 2020 and is pleased to announce the appointment of James Beriker to the Board of Directors. Mr. Beriker is a Silicon Valley based technology entrepreneur and executive with start-up, growth stage and public company experience. His business experience includes entrepreneurial and executive positions in business-to-business advertising and marketing technology companies including as Founder/ CEO and Director of Search123, an early pay-per-click search engine (acquired by Conversant (formerly ValueClick)), CEO and Director of Efficient Frontier, a leading search engine marketing platform (acquired by Adobe), CEO and Director of Dapper, one of the first creative optimization platforms  (acquired by Yahoo!), among others. Mr. Beriker is currently the CEO of LifeCycle Group, a firm made up of leaders in management, product management, engineering and finance that provides strategic and operational support for venture-backed companies. Mr. Beriker’s appointment to the Company’s board of directors is subject to the approval of the TSX Venture Exchange (the “TSX-V”).","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Acceleration of Expiry Date of Warrants","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The Company also announces today that it is accelerating the expiry date of 3,333,333 outstanding common share purchase warrants (the “Warrants), which were issued pursuant to a non-brokered private placement in December 2019. Each Warrant is exercisable at a price of $1.00 per common share for a period of 24 months following issuance. The terms of the Warrants are such that the expiry date can be accelerated by the Company at any time if the closing price of the Company’s common shares on the facilities of the TSX-V is greater than $1.25 for any 10 consecutive trading days following the date that is four months and one day after the closing of the private placement (the “Acceleration Trigger”).","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The Company confirms that as of the close of markets on May 25, 2020, the Acceleration Trigger had occurred. The Company intends delivered notice of the acceleration of the expiry date to each of the holders of Warrants, which will cause the Warrants to expire at 5:00 p.m. (Toronto time) on the 30th day following the delivery of the notice of acceleration (the “Accelerated Expiry Date”). Any Warrants remaining unexercised after the Accelerated Expiry Date will be cancelled. As of the close of markets on May 26, 2020, a total of 3,333,333 Warrants were outstanding. If all of the outstanding Warrants are exercised, gross proceeds to the Company will total $3,333,333.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Non-IFRS Financial Measures ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Works measures the success of the Company’s strategies and performance based on Adjusted EBITDA, which is outlined and reconciled with net income (loss) in the section entitled “Reconciliation of Net Loss for the period to Adjusted EBITDA” in the MD&A. The Company defines Adjusted EBITDA as net income (loss) from operations before: (a) depreciation of property and equipment and amortization of intangible assets, (b) share-based payments, (c) finance income and costs, net, (d) depreciation of right-of-use assets, and (e) transaction costs of acquisition. Management uses Adjusted EBITDA as a measure of the Company's operating performance because it provides information on the Company's ability to provide operating cash flows for working capital requirements, capital expenditures, and potential acquisitions. The Company also believes that analysts and investors use Adjusted EBITDA as a supplemental measure to evaluate the overall operating performance of companies in its industry.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The non-IFRS financial measure is used in addition to, and in conjunction with, results presented in the Company’s consolidated financial statements prepared in accordance with IFRS and should not be relied upon to the exclusion of IFRS financial measures. Management strongly encourages investors to review the Company's consolidated financial statements in their entirety and to not rely on any single financial measure. Because non-IFRS financial measures are not standardized, it may not be possible to compare these financial measures with other companies' non-IFRS financial measures having the same or similar names. In addition, the Company expects to continue to incur expenses similar to the non-IFRS adjustments described above, and exclusion of these items from the Company's non-IFRS measures should not be construed as an inference that these costs are unusual, infrequent, or non-recurring.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The table below reconciles net loss from operations and Adjusted EBITDA for the periods presented:","nodeType":"text"}],"nodeType":"paragraph"},{"data":{"target":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2YwxI3FCNzG5MYHlYeXumR","type":"Asset","createdAt":"2020-09-03T18:19:30.663Z","updatedAt":"2020-09-03T18:31:44.272Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"Financials - 2020 Q1","description":"Financials - 2020 Q1","file":{"url":"//images.ctfassets.net/nph7if1oawhd/2YwxI3FCNzG5MYHlYeXumR/e04287f12dc48f2aa271753d3b88b530/1stq20.jpg","details":{"size":37526,"image":{"width":626,"height":291}},"fileName":"1stq20.jpg","contentType":"image/jpeg"}}}},"content":[],"nodeType":"embedded-asset-block"},{"data":{},"content":[{"data":{},"marks":[],"value":"","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":" About EQ Works","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Works (","nodeType":"text"},{"data":{"uri":"http://www.eqworks.com/"},"content":[{"data":{},"marks":[],"value":"www.eqworks.com","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":") enables businesses to understand, predict, and influence customer behaviour. Using unique data sets, advanced analytics, machine learning and artificial intelligence, EQ Works creates actionable intelligence for businesses to attract, retain, and grow the customers that matter most. The Company’s proprietary SaaS platform mines insights from movement and geospatial data, enabling businesses to close the loop between digital and real-world consumer actions.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[],"nodeType":"hr"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":" ","nodeType":"text"},{"data":{},"marks":[{"type":"italic"}],"value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":" Forward-Looking Statements","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Certain statements contained in this press release constitute “forward-looking statements”. All statements other than statements of historical fact contained in this press release, including, without limitation, those regarding the Company’s ability to adjust to customer needs in light of COVID-19, the delivery of acceleration notices to the holders of Warrants and the exercise of the Warrants by holders, future financial position and results of operations, strategy, plans, objectives, goals and targets, and any statements preceded by, followed by or that include the words “believe”, “expect”, “aim”, “intend”, “plan”, “continue”, “will”, “may”, “would”, “anticipate”, “estimate”, “forecast”, “predict”, “project”, “seek”, “should” or similar expressions, or the negative thereof, are forward-looking statements. These statements are not historical facts but instead represent only the Company’s expectations, estimates, and projections regarding future events. These statements are not guarantees of future performance and involve assumptions, risks, and uncertainties that are difficult to predict. Therefore, actual results may differ materially from what is expressed, implied, or forecasted in such forward-looking statements. Additional factors that could cause actual results, performance, or achievements to differ materially include, but are not limited to, the risk factors discussed in the Company’s MD&A for the three months ended March 31, 2020. Management provides forward-looking statements because it believes they provide useful information to investors when considering their investment objectives but cautions investors not to place undue reliance on forward-looking information. Consequently, all of the forward-looking statements made in this press release are qualified by these cautionary statements and any other cautionary statements or factors contained herein, and there can be no assurance that the actual results or developments will be realized or, even if substantially realized, that they will have the expected consequences to, or effects on, the Company. These forward-looking statements are made as of the date of this press release, and the Company assumes no obligation to update or revise them to reflect subsequent information, events, or circumstances or otherwise, except as required by law.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Inc.\nPeter Kanniah, Chief Financial Officer\n","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"416-260-4326\n","nodeType":"text"},{"data":{},"marks":[],"value":"1235 Bay Street, Suite 401| Toronto, Ontario |M5R 3K4\n","nodeType":"text"},{"data":{"uri":"mailto:press@eqworks.com"},"content":[{"data":{},"marks":[],"value":"press@eqworks.com","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":"\n","nodeType":"text"},{"data":{"uri":"http://www.eqworks.com"},"content":[{"data":{},"marks":[],"value":"www.eqworks.com","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":"","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}}},"__N_SSG":true}