{"pageProps":{"pressRelease":{"title":"EQ Inc. and Opta Information Intelligence Announce Partnership","slug":"eq-inc-and-opta-information-intelligence","excerpt":"EQ Inc. announced a partnership to deliver new and advanced solutions to the insurance industry and other verticals.","author":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2020-04-28T00:00-04:00","categories":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"TORONTO, ON (April 28, 2020) -","nodeType":"text"},{"data":{},"marks":[],"value":" EQ Inc. (TSXV: EQ) (“EQ Works”, “EQ” or the “Company”), a leader in geospatial data and intelligence, and Opta Information Intelligence Inc. (“Opta”), Canada’s largest property location intelligence provider and leader of innovative technology solutions, are pleased to announce a partnership to deliver new and advanced solutions to the insurance industry and other verticals.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"This data and technology partnership will create unique targeting and performance products including specialized predictive models, improved segmentation tools and in-depth analytics. By combining Canada’s richest device graph (EQ) and the largest residential and business data set (Opta), the partnership is a game changer for the Insurance and Financial Services industry.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"“We are thrilled to be partnering with Opta,” said Geoffrey Rotstein, President and CEO of EQ Works. “In a data driven economy, the ability to provide predictive models that show companies where to focus is a huge advantage. Our combined solution will provide information to insurance companies, financial institutions and auto brands to better understand where to focus to improve lead scoring, acquisition capabilities and overall performance for all of their data-driven marketing work.”","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ is the data solutions partner of choice for many of North America’s leading brands.  Its data and technology platforms are widely regarded as best-in-class for providing data measurement and attribution capabilities, business and consumer insights at scale. This partnership will enhance EQ’s data and product offering by delivering enriched solutions for the insurance industry and beyond.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Opta, the Canadian insurance market leader for property location intelligence and consumer behavior, is excited about enhancing its suite of solutions via this partnership. The combination of enhanced geospatial consumer behaviour data, along with detailed property and location intelligence information, will provide the foundation for a broad range of new solutions powered by consumer insights.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"“We have recently all seen just how fast our businesses can change. We are all tasked with ensuring our customers and their customers receive the best products and services possible,” said Opta President, Greg McCutcheon. “We are committed to delivering tools that allow brokers and insurers to enhance their client relationships, while improving their underlying competitiveness. We have insights into 13MM residences and more than 4.4MM business locations across Canada and we now offer insights into the behaviours of the people occupying them.”","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"About OPTA INFORMATION INTELLIGENCE ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Opta Information Intelligence is Canada’s largest aggregator of property risk information and leading provider of property intelligence and innovative technology solutions for insurance and corporate industries. Opta helps you access, understand, and synthesize previously inaccessible information, turning it into intelligence that helps to discover and understand business risks. Visit  ","nodeType":"text"},{"data":{"uri":"http://www.optaintel.ca/"},"content":[{"data":{},"marks":[],"value":"www.optaintel.ca","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":"","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"About EQ Works","nodeType":"text"},{"data":{},"marks":[],"value":"EQ Works (www.eqworks.com) provides a smarter way to target customers. Using first-party, location-based behaviour signals, advanced data analytics, and proprietary software, EQ creates and targets customized, performance-boosting audience segments. Proprietary algorithms and data generate attribution models that connect consumer behavior in the physical world to consumer behavior in the digital world, solving complex challenges for brands and agencies.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[],"nodeType":"hr"},{"data":{},"content":[{"data":{},"marks":[{"type":"italic"}],"value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Forward-Looking Statements","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"This news release may contain forward-looking statements that are based on management’s current expectations and are subject to known and unknown uncertainties and risks, which could cause actual results to differ materially from those contemplated or implied by such forward-looking statements.  EQ Inc. is under no obligation to update any forward-looking statements contained herein should material facts change due to new information, future events or otherwise.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Inc.\n1235 Bay Street, Suite 401| Toronto, Ontario |M5R 3K4\n","nodeType":"text"},{"data":{"uri":"mailto:press@eqworks.com"},"content":[{"data":{},"marks":[],"value":"press@eqworks.com","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":"\nwww.eqworks.com","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}}},"__N_SSG":true}