{"pageProps":{"pressRelease":{"title":"EQ Inc. Announces Data Services Contract Engagement with one of Canada's Largest Integrated Media Companies","slug":"eq-inc-announces-data-services-contract-engagement","excerpt":"LOCUS platform to provide data, AI and insights to leverage online and traditional audiences","author":{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2021-06-08T08:00-04:00","categories":[{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"TORONTO, ON (June 8, 2021) - ","nodeType":"text"},{"data":{},"marks":[],"value":"EQ Inc. (TSXV: EQ) (“EQ Works” or the “Company”), a leader in geospatial data and artificial intelligence driven software, is pleased to announce that it has entered into a data services contract with one of Canada’s largest media companies. The engagement, which will operate across multiple print, online and mobile platforms, represents a significant step forward for EQ as it adds another client to its roster of Canada’s largest integrated media companies. These organizations will utilize the LOCUS platform (“LOCUS”) to derive deeper insights from data analytics and intelligence executed across both online and offline channels. Integrated media companies understand the value of data and EQ’s ability to provide solutions that further enhance their internal capabilities.  This endorsement reinforces and further validates EQ’s core strength of delivering value through data analytics and intelligence.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"“We are thrilled to be working with such an iconic and sophisticated media group with the vision to recognize the strategic importance of data,” said Mark Ditkofsky, Vice President of Data Solutions, EQ Works. “Our platform is positioned perfectly to address the needs of companies that understand the importance of data. Utilizing LOCUS for audience analysis, attribution reporting, customer classifications and enriching existing data sets will allow our client to more deeply understand their target customers who drive value for their business.\"","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":" The engagement will utilize LOCUS to combine the client’s digital customer data with EQ’s rich real-world geospatial data sets and proprietary machine learning and AI tools, to provide insights and intelligence that create: ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"digital audience segment and customer classifications; ","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"offline and online attribution reporting; ","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"improved targeting and attribution for traditional advertising; ","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"sophisticated reporting and predictive insights into consumer behavior; and ","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"performance data and analytics to drive improved ROI.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"}],"nodeType":"unordered-list"},{"data":{},"content":[{"data":{},"marks":[],"value":"As businesses continue to understand the essential impact that data will have on their overall strategy, platforms like LOCUS play an increasingly important role. Across all industries, demand for LOCUS continues to increase and EQ’s data driven platforms are perfectly positioned to excel in this data driven age. ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[],"nodeType":"hr"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"About EQ Works","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Works (www.eqworks.com) enables businesses to understand, predict, and influence customer behaviour. Using unique data sets, advanced analytics, machine learning and artificial intelligence, EQ Works creates actionable intelligence for businesses to attract, retain, and grow the customers that matter most. The Company’s proprietary SaaS platform mines insights from movement and geospatial data, enabling businesses to close the loop between digital and real-world consumer actions.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":" ","nodeType":"text"},{"data":{},"marks":[{"type":"italic"}],"value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Forward-Looking Statements","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Certain statements contained in this press release constitute “forward-looking statements”. All statements other than statements of historical fact contained in this press release, including, without limitation, those regarding the Company’s future financial position and results of operations, strategy, plans, objectives, goals and targets, and any statements preceded by, followed by or that include the words “believe”, “expect”, “aim”, “intend”, “plan”, “continue”, “will”, “may”, “would”, “anticipate”, “estimate”, “forecast”, “predict”, “project”, “seek”, “should” or similar expressions, or the negative thereof, are forward-looking statements. These statements are not historical facts but instead represent only the Company’s expectations, estimates, and projections regarding future events. These statements are not guarantees of future performance and involve assumptions, risks, and uncertainties that are difficult to predict. Therefore, actual results may differ materially from what is expressed, implied, or forecasted in such forward-looking statements. Additional factors that could cause actual results, performance, or achievements to differ materially include, but are not limited to, the risk factors discussed in the Company’s MD&A for the year ended December 31, 2020. Management provides forward-looking statements because it believes they provide useful information to investors when considering their investment objectives but cautions investors not to place undue reliance on forward-looking information. Consequently, all of the forward-looking statements made in this press release are qualified by these cautionary statements and any other cautionary statements or factors contained herein, and there can be no assurance that the actual results or developments will be realized or, even if substantially realized, that they will have the expected consequences to, or effects on, the Company. These forward-looking statements are made as of the date of this press release, and the Company assumes no obligation to update or revise them to reflect subsequent information, events, or circumstances or otherwise, except as required by law.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Peter Kanniah, Chief Financial Officer – 416-260-4326 • 1235 Bay Street, Suite 401 Toronto, Ontario M5R 3K4","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Bill Mitoulas, Investor Relations – 416-479-9547 • ","nodeType":"text"},{"data":{"uri":"mailto:press@eqworks.com"},"content":[{"data":{},"marks":[],"value":"press@eqworks.com","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[{"type":"bold"}],"value":"","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}}},"__N_SSG":true}