{"pageProps":{"pressRelease":{"title":"EQ Works Extends Multi-Year Data Engagement with Leading Canadian University to Drive Applications and Enrollment","slug":"extends-data-engagement-with-canadian-university","excerpt":"EQ Works is pleased to announce that a leading Canadian university has extended its partnership with EQ for a fifth consecutive term.","author":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2020-10-27T00:00-05:00","categories":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"nodeType":"document","data":{},"content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Toronto, ON (October 27, 2020) – EQ Inc. (TSXV: EQ) (“EQ Works” or “EQ”), a leader in geospatial data and intelligence is pleased to announce that a leading Canadian university has extended its partnership with EQ for a fifth consecutive term. This fifth mandate of approximately $400,000, represents an increase from previous years and will be used to deploy the EQ platform to identify and engage the most sought-after students both domestically and internationally. EQ’s proprietary platforms have embedded machine learning and AI algorithms that allow each initiative to be optimized individually and each to be executed to its maximum potential. As a result of the past success of the program, EQ has expanded its engagement by 50% and now includes multiple new international markets.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"“EQ has consistently been able to deliver results to ensure that we attract the best students in the world for a variety of our programs’” said the University’s Manager of Digital Marketing. “By combining data solutions and advanced analytics to track the student recruitment journey and engage students across various media platforms, performance has improved every year through EQ.” EQ’s efforts have resulted in an increase in quality applications of more than 150% over the term of the engagement for students with a grade point average (GPA) greater than the University’s average.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"“We are very pleased with the results that we are able to generate for the University and are appreciative of the confidence that it has placed in us to advance its recruiting process for the most competitive students,” said Tom Wainas, VP Client Success EQ Works. “Our data and machine learning capabilities are able to pick up signals for the best candidates that we can then target through a variety of platforms.”","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"ABOUT EQ WORKS ","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":"EQ Works (www.eqworks.com) enables businesses to understand, predict, and influence customer behaviour. Using unique data sets, advanced analytics, machine learning and artificial intelligence, EQ Works creates actionable intelligence for businesses to attract, retain, and grow the customers that matter most. The Company’s proprietary SaaS platform mines insights from movement and geospatial data, enabling businesses to close the loop between digital and real-world consumer actions.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release. ","marks":[{"type":"italic"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Forward-Looking Statements ","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"This news release may contain forward-looking statements that are based on management’s current expectations and are subject to known and unknown uncertainties and risks, which could cause actual results to differ materially from those contemplated or implied by such forward-looking statements. EQ Inc. is under no obligation to update any forward-looking statements contained herein should material facts change due to new information, future events or otherwise.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ Inc. 1235 Bay Street, Suite 401\nToronto, Ontario M5R 3K4","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"press@eqworks.com\nwww.eqworks.com","marks":[],"data":{}}],"data":{}}]}}},"__N_SSG":true}