{"pageProps":{"post":{"slug":"2020-06-30-caddle-partner-covid-behavior","title":"EQ Works and Caddle Partner to Understand “COVID” Consumer Behavior","excerpt":"Unique research shows COVID-19s impact on shrinking trade areas and fractured consumer expectations; AI, location data, and consumer insights become the required play-book for the re-opening phase of the economy","date":"June 30, 2020","author":"EQ Works","category":"Press Releases","content":"<p>Toronto, ON (June 30, 2020) – EQ Inc. (TSXV: EQ) (“EQ Works” or “EQ”), a leader in geospatial location data and intelligence, and Caddle, a mobile first insights platform, announced today the findings from an exclusive joint research project which illustrates the challenges businesses and brands face as the economy re-opens to a world of smaller geographic trade-areas, and a complex mix of consumer expectations.</p>\n<p>A survey of 10,000 Canadians analyzed how consumer behaviour changed during the COVID-19 lock-downs, encompassing ecommerce, physical distancing, travel, grocery consumption, attitudes towards government, and mobile phone usage, among a myriad of other factors. EQ Works and Caddle partnered on this initiative to help brands and marketers better understand how people of different age groups, locations, income levels and other demographic traits changed their behaviors during the COVID-19 period, and how that has impacted the consumer landscape.</p>\n<p>Highlights and takeaways include:</p>\n<ul>\n<li>Canadians’ perspectives of social distancing varies by age and income.\nImplication: Successful marketing efforts require an awareness of differing consumer expectations, and an ability to make those insights “addressable” through rich, predictive targeting that marries location data and consumer propensities\nConsumers plan to stay at home and shop more local than before.</li>\n<li>Implication: Businesses will need to understand the consumers in their trade areas with greater precision as the battle for market share plays out in smaller geographic areas. Predicting and influencing consumer behavior in smaller spaces require fine-grain location and propensity data, coupled with AI-based execution.</li>\n</ul>\n<p>“These are actionable consumer insights. Our data can help brands be more effective with their marketing activities,” says Caddle Chief Growth Officer, Mick Higgins.</p>\n<p>“With these data we can execute better for our clients” said Geoffrey Rotstein, President and CEO EQ Works. “The more rich and nuanced the data-sets, the better our machine learning and AI algorithms perform to understand and predict consumer activities to give our clients an edge.”</p>\n<p>With the economy opening up across Canada, experts are predicting uneven patterns of consumer activity and a possible second wave of COVID. Understanding and predicting consumer behaviour is key to an effective marketing and communications plan.</p>\n<p><strong>ABOUT EQ WORKS</strong>\nEQ Works (<a href=\"http://www.eqworks.com\">www.eqworks.com</a>) enables businesses to understand, predict, and influence customer behaviour. Using unique data sets, advanced analytics, machine learning and artificial intelligence, EQ Works creates actionable intelligence for businesses to attract, retain, and grow the customers that matter most. The Company’s proprietary SaaS platform mines insights from movement and geospatial data, enabling businesses to close the loop between digital and real-world consumer actions.</p>\n<p><strong>ABOUT CADDLE</strong>\nCaddle® is the largest mobile-first insights platform that rewards Canadian consumers for sharing data and engaging with brands. The Caddle data and insights marketplace is powered by the Caddle app, where consumers’ sign-up and complete research activities like answering surveys, uploading receipts and providing their opinion in exchange for cash-back rewards.</p>\n<hr>\n<p>Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.</p>\n<p><strong>Forward-Looking Statements</strong>\nThis news release may contain forward-looking statements that are based on management’s current expectations and are subject to known and unknown uncertainties and risks, which could cause actual results to differ materially from those contemplated or implied by such forward-looking statements. EQ Inc. is under no obligation to update any forward-looking statements contained herein should material facts change due to new information, future events or otherwise.</p>\n<p>EQ Inc.\n1235 Bay Street, Suite 401| Toronto, Ontario |M5R 3K4\n<a href=\"mailto:press@eqworks.com\">press@eqworks.com</a>\n<a href=\"http://www.eqworks.com\">www.eqworks.com</a></p>\n"}},"__N_SSG":true}