{"pageProps":{"pressRelease":{"title":"EQ Works and Media City Partner to Expand DOOH Measurement Capabilities","slug":"eq-works-and-media-city-partner-to-expand-dooh","excerpt":"EQ Inc. and Media City are partnering to better connect online and offline media by enabling measurement of Digital-Out-Of-Home (“DOOH”) placements.","author":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2020-05-20T00:00-04:00","categories":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Toronto, ON (May 20, 2020) – EQ Inc. (TSXV: EQ) (“EQ Works”, “EQ” or the (“Company”), a leader in geospatial location data and intelligence, and Media City are partnering to better connect online and offline media by enabling measurement of Digital-Out-Of-Home (“DOOH”) placements.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"After testing many platforms, Media City chose EQ Works as their preferred partner because of their ability to analyze data at scale. This deal will enable Media City to offer its clients exposure measurement, store visit tracking, as well as brand lift reports and recall studies.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"“The challenge, in Out-Of-Home (“OOH”), has been to show that it delivers measurable results for advertisers – which will be even more important in today’s environment,” says Media City CEO, Sylvio Deluca.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"“With EQ Works as our partner, we can provide better measurement of our OOH assets. We’ve formed a strong partnership that makes it easy for our clients to execute and adds quantifiable value and results to our DOOH and Office Tower ad placements.”","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"“We are thrilled to be partnering with Media City. The power of OOH and digital attribution is well-known. By bringing together two Canadian companies, we are able to provide valuable measurement capabilities to brands and to agencies,” said Geoffrey Rotstein, President and CEO of EQ Works.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"DOOH is a leading advertising platform in the digital marketing space, which has seen rapid growth over the past several years.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"According to a report published by Allied Market Research, the global DOOH market accounted approximately $3.6 billion in 2016 and it is projected to reach over $8 billion by 2023, growing a CAGR of 12.60% from 2017 to 2023.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Factors such as cost-effectiveness, attainment of large audiences and the ability to map consumer journeys are driving the demand for DOOH in the market. With the EQ Works data platform, this partnership brings improved measurement to DOOH.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"ABOUT MEDIA CITY","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":" ","nodeType":"text"},{"data":{},"marks":[],"value":"Media City delivers compelling ad space to targeted audiences in Outdoor, Office Tower and Shopping Centre environments.  Media City is a fiercely independent media company that believes in doing things differently and providing ad spaces that are innovative, creative and leave a strong lasting impression. ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"ABOUT EQ Works","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Works (www.eqworks.com) provides a smarter way to target customers. Using first-party, location-based behaviour signals, advanced data analytics, and proprietary software, EQ creates and targets customized, performance-boosting audience segments. Proprietary algorithms and data generate attribution models that connect consumer behaviour in the physical world to consumer behaviour in the digital world, solving complex challenges for brands and agencies.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[],"nodeType":"hr"},{"data":{},"content":[{"data":{},"marks":[{"type":"italic"}],"value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Forward-Looking Statements","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"This news release may contain forward-looking statements that are based on management’s current expectations and are subject to known and unknown uncertainties and risks, which could cause actual results to differ materially from those contemplated or implied by such forward-looking statements.  EQ Inc. is under no obligation to update any forward-looking statements contained herein should material facts change due to new information, future events or otherwise.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Inc.\n1235 Bay Street, Suite 401| Toronto, Ontario |M5R 3K4\n","nodeType":"text"},{"data":{"uri":"mailto:press@eqworks.com"},"content":[{"data":{},"marks":[],"value":"press@eqworks.com","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":"\nwww.eqworks.com","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}}},"__N_SSG":true}