{"pageProps":{"pressRelease":{"title":" EQ Inc. Announces $1.8 Million Agreement with Leading Media Agency Holding Company","slug":"eq-announces-agreement-with-leading-media-agency","excerpt":"LOCUS platform to provide data solutions and insights to leverage online and offline audiences","author":{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2021-06-16T08:00-04:00","categories":[{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"nodeType":"document","data":{},"content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"TORONTO, ON (June 16, 2021) - ","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":"EQ Inc. (TSXV: EQ) (“EQ Works” or the “Company”), a leader in using geospatial data and artificial intelligence to drive critical business outcomes for enterprises and their agencies, is pleased to announce that it has entered into a data and media services agreement with one of Canada’s largest media agency holding companies. The initial term of the partnership is for 12 months and the budget of approximately $1.8M will consist of fees for platform licensing, data usage, insights, analytics, and execution.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"This partnership represents a significant step forward for EQ and its data platform strategy, as it onboards another large media agency to its expanding roster of clients. The addition of one of Canada’s most sophisticated agencies, following a rigorous competitive selection process, is a strong signal that brands and their agencies are beginning to more fully appreciate the critical function of a differentiated, data-first approach to driving business outcomes.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"“The largest brands rely on their agencies to source technology solutions that drive the best results, and we are thrilled to have been selected by this leading agency” said Geoffrey Rotstein, CEO of EQ Works. “With the largest media and data budgets still being delivered through agency partners, we are excited to be deploying our platform capabilities to drive better performance for their clients. With our strong balance sheet, our proprietary technology, a team of data scientists, data engineers and operations specialists, we are excited with this initial engagement and look forward to working with them to evolve how they drive results for their clients.”","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ's LOCUS platform was selected due to its industry leading volume of geospatial data, its ability to seamlessly integrate and normalize first and third-party datasets, its proprietary algorithms, and its customer delivery team and capabilities. EQ’s team will assist the agency throughout the engagement by focusing on:","marks":[],"data":{}}],"data":{}},{"nodeType":"unordered-list","content":[{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"enriching the client’s 1st party proprietary data and other offline data into actionable online segments; ","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"providing advanced planning, analytics and predictive modelling;","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"driving targeted media buying and generating post campaign analysis; and","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"leveraging the LOCUS platform across a number of new verticals including automotive and retail.","marks":[],"data":{}}],"data":{}}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"As enterprises evolve their understanding of data, and work to leverage their own systems and third-party data to impact business outcomes, LOCUS is perfectly positioned to apply its unique capabilities across industries. ","marks":[],"data":{}}],"data":{}},{"nodeType":"hr","content":[],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"About EQ Works","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ Works (www.eqworks.com) enables businesses to understand, predict, and influence customer behaviour. Using unique data sets, advanced analytics, machine learning and artificial intelligence, EQ Works creates actionable intelligence for businesses to attract, retain, and grow the customers that matter most. The Company’s proprietary SaaS platform mines insights from movement and geospatial data, enabling businesses to close the loop between digital and real-world consumer actions.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","marks":[{"type":"italic"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Forward-Looking Statements","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Certain statements contained in this press release constitute “forward-looking statements”. All statements other than statements of historical fact contained in this press release, including, without limitation, those regarding the Company’s future financial position and results of operations, strategy, plans, objectives, goals and targets, and any statements preceded by, followed by or that include the words “believe”, “expect”, “aim”, “intend”, “plan”, “continue”, “will”, “may”, “would”, “anticipate”, “estimate”, “forecast”, “predict”, “project”, “seek”, “should” or similar expressions, or the negative thereof, are forward-looking statements. These statements are not historical facts but instead represent only the Company’s expectations, estimates, and projections regarding future events. These statements are not guarantees of future performance and involve assumptions, risks, and uncertainties that are difficult to predict. Therefore, actual results may differ materially from what is expressed, implied, or forecasted in such forward-looking statements. Additional factors that could cause actual results, performance, or achievements to differ materially include, but are not limited to, the risk factors discussed in the Company’s MD&A for the year ended December 31, 2020. Management provides forward-looking statements because it believes they provide useful information to investors when considering their investment objectives but cautions investors not to place undue reliance on forward-looking information. Consequently, all of the forward-looking statements made in this press release are qualified by these cautionary statements and any other cautionary statements or factors contained herein, and there can be no assurance that the actual results or developments will be realized or, even if substantially realized, that they will have the expected consequences to, or effects on, the Company. These forward-looking statements are made as of the date of this press release, and the Company assumes no obligation to update or revise them to reflect subsequent information, events, or circumstances or otherwise, except as required by law.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Peter Kanniah","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":", Chief Financial Officer – 416-260-4326 • 1235 Bay Street, Suite 401 Toronto, Ontario M5R 3K4","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Bill Mitoulas","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":", Investor Relations – 416-479-9547 • ","marks":[],"data":{}},{"nodeType":"hyperlink","content":[{"nodeType":"text","value":"press@eqworks.com","marks":[],"data":{}}],"data":{"uri":"mailto:press@eqworks.com"}},{"nodeType":"text","value":"","marks":[],"data":{}}],"data":{}}]}}},"__N_SSG":true}