{"pageProps":{"pressRelease":{"title":"EQ Inc. Reports Profitable Fourth Quarter and 2017 Year-End Financial Results","slug":"eq-inc-reports-profitable-fourth-quarter-and-2017","excerpt":"EQ Inc. announces its financial results today for the full year and fourth quarter ended December 31, 2017.","author":{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2018-04-26T00:00-04:00","categories":[{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Toronto, ON:","nodeType":"text"},{"data":{},"marks":[],"value":" April 26, 2018 - EQ Inc. (TSXV: EQ) (“EQ Works” or the “Company”), North America’s leader in Location Behaviour data and intelligence, announced its financial results today for the full year and fourth quarter ended December 31, 2017.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Revenue for the year increased by 62% to $5.5 million from the $3.4 million recorded in the previous year and the adjusted EBITDA loss for the year decreased significantly to approximately $0.5 million, an improvement of 64% from the previous year. ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Revenue for the fourth quarter was $1.6 million, an increase of 61% from the same period a year ago and the Company was able to generate a positive adjusted EBITDA. These results show the leverage that has been built into the business model and the financial success that can be achieved when operating at scale. This was a substantial improvement from the results of the same quarter a year ago and an increase from the prior quarter.  Gross margin for the fourth quarter was 49%.  This is an increase from the gross margin generated in the previous quarter and is attributed to the change in revenue mix, which included an increased amount of data. ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Data has become a key differentiator for performance.  The Company’s ability to understand real world behaviors and incorporate thousands of different data signals into how it builds audiences is a unique value proposition that generates higher margins and represents a clear differentiator to the Canadian market.  Over the course of 2017, the Company made significant investments in systems and platforms that collect and utilize data to help brands better understand and engage with their audience. Businesses have to better understand their customers to be successful.   EQ Works incorporates unique location data and statistics to provide substantial insights and enhance their overall digital marketing initiatives. ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"“With our focus on incorporating data into our value proposition, the strong growth experienced over the past year has been transformational for the Company. I am pleased with the success of our new partnerships and the evolution of our product lineup as data becomes even more essential to marketing professionals, “said Geoffrey Rotstein, President and CEO of EQ Works. “The Canadian market lacks comprehensive and reliable data sources when it comes to digital marketing and we are extremely well-positioned to benefit from the continued shift to data-informed advertising.”","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Highlights for the Year and Fourth Quarter ended December 31, 2017","nodeType":"text"}],"nodeType":"heading-5"},{"data":{},"content":[{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Increased revenue by 62% compared to the same period  a year ago and 61% when compared to the fourth quarter of 2016","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Data revenue increased to 5% of total revenue by the fourth quarter of 2017 ","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Improved gross profit resulting in a 52% increase from the previous year","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Signing of multiple third-party data partnerships to enrich service offering","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Added over 51 new portfolio clients","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Pending implementation of TAG Verified status, representing an ongoing commitment to anti-fraud","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"}],"nodeType":"unordered-list"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Non-IFRS Financial Measures","nodeType":"text"}],"nodeType":"heading-5"},{"data":{},"content":[{"data":{},"marks":[],"value":"We measure the success of our strategies and performance based on Adjusted EBITDA, which is outlined and reconciled with net income (loss) in the section entitled “Reconciliation of Net Loss for the period to Adjusted EBITDA” in the MD&A. The Company defines Adjusted EBITDA as net income (loss) from operations before; (a) depreciation of property and equipment and amortization of domain properties and other intangible assets, (b) share-based payments, (c) finance income and costs, net, (d) gain from extension of loans and borrowings (e) Realized gain on sale of investment. Management uses Adjusted EBITDA as a measure of the Company's operating performance because it provides information related to the Company's ability to provide operating cash flows for working capital requirements, capital expenditures, and potential acquisitions. The Company also believes that analysts and investors use Adjusted EBITDA as a supplemental measure to evaluate the overall operating performance of companies in its industry.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The non-IFRS financial measure is used in addition to and in conjunction with results presented in the Company’s  consolidated financial statements prepared in accordance with IFRS and should not be relied upon to the exclusion of IFRS financial measures. Management strongly encourages investors to review the Company's consolidated financial statements in their entirety and to not rely on any single financial measure. Because non-IFRS financial measures are not standardized, it may not be possible to compare these financial measures with other companies' non-IFRS financial measures having the same or similar names. In addition, the Company expects to continue to incur expenses similar to the non-IFRS adjustments described above, and exclusion of these items from the Company's non-IFRS measures should not be construed as an inference that these costs are unusual, infrequent or non-recurring.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The table below reconciles net loss from operations and Adjusted EBITDA for the periods presented:","nodeType":"text"}],"nodeType":"paragraph"},{"data":{"target":{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"6ez5uWZrViNLQZaVVUHRwn","type":"Asset","createdAt":"2020-09-03T16:02:08.748Z","updatedAt":"2020-09-03T18:36:23.810Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":2,"locale":"en-US"},"fields":{"title":"Financials - 2017 Q4","description":"Financials - 2017 Q4","file":{"url":"//images.ctfassets.net/nph7if1oawhd/6ez5uWZrViNLQZaVVUHRwn/e2e30594a47b1784ad4b21f2b53fa2ce/EQ-Works-Adjusted-EBITDA-YE-Dec-31-2017.png","details":{"size":142190,"image":{"width":1426,"height":686}},"fileName":"EQ-Works-Adjusted-EBITDA-YE-Dec-31-2017.png","contentType":"image/png"}}}},"content":[],"nodeType":"embedded-asset-block"},{"data":{},"content":[{"data":{},"marks":[],"value":"","nodeType":"text"},{"data":{"uri":"https://www.eqworks.com/wp-content/uploads/2018/04/EQ-Works-Financials-2017-Q4.pdf"},"content":[{"data":{},"marks":[{"type":"italic"}],"value":"2017 Year-End Financial Statements available here.","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":"","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"About EQ Works:","nodeType":"text"}],"nodeType":"heading-6"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Works (","nodeType":"text"},{"data":{"uri":"http://www.eqworks.com/"},"content":[{"data":{},"marks":[],"value":"www.eqworks.com","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":") provides a smarter way to target customers. Using first-party, location-based behaviour signals, advanced data analytics, and proprietary software, EQ creates and targets customized, performance-boosting audience segments. Proprietary algorithms and data generate attribution models that connect consumer behavior in the physical world to consumer behavior in the digital world, solving complex challenges for brands and agencies.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}}},"__N_SSG":true}