{"pageProps":{"pressRelease":{"title":"EQ Inc. Acquires Industry Leader Tapped Mobile","excerpt":"EQ Inc. is bringing together two of Canada’s leaders in mobile data and location based marketing solutions.","author":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2018-10-16T00:00-04:00","slug":"eq-inc-acquires-industry-leader-tapped-mobile","categories":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"nodeType":"document","data":{},"content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"TORONTO, ON (October 15, 2018) -","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":" EQ Inc. (TSXV: EQ) (“EQ Works” or the “Company”), North America’s leader in Location Behaviour data and intelligence, is pleased to announce that subject to final TSX Venture Exchange (“TSX-V”) approval, it has completed the acquisition of Tapped Networks Inc. (“Tapped Mobile”) bringing together two of Canada’s leaders in mobile data and location based marketing solutions.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"“We are thrilled that Tapped Mobile will be joining EQ.” said Geoffrey Rotstein, President and CEO of EQ Works. “Tapped Mobile is well known for bringing cutting edge mobile solutions to Canada and the U.S. and with them we have further strengthened our data, optimization, and mobile programmatic media capabilities.  Combining EQ’s proprietary location based data platform with Tapped’s marketing solutions enables us to expand our offering and aggressively enter into new markets as we continue to help our clients drive better business results. We have known Jed Schneiderman and his team for a number of years and have always been impressed with their focused approach towards data and technology and their extensive relationships across the marketing, media and technology communities.”","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"The acquisition of Tapped Mobile will provide:","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"unordered-list","content":[{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Increased scale to its existing business in Canada and the U.S.;","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"New and incremental revenue opportunities;","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Additional sales presence to better service the Canadian market and pursue strategic segments in the U.S.;","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Increased expertise to further enhance and leverage EQ’s location based data platform; and","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"New partnership opportunities with some of North America’s leading company’s for digital marketing solutions.","marks":[],"data":{}}],"data":{}}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Tapped Mobile has been providing mobile data and marketing solutions to agencies and brands for over 7 years utilizing a variety of digital and mobile-specific products.  Forming strong relationships with major Canadian agencies, securing the Canadian rights to some of the best technology solutions from the U.S. and developing direct partnerships through Shazam and BBM has enabled them to identify leading trends that helped shape the Canadian marketing and media landscape.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"“Having worked with the best digital companies, we have long been impressed with EQ and its proprietary location based targeting platform. Brands are trying to better connect the physical and digital worlds to drive their business.” said Jed Schneiderman, President and Co-Founder of Tapped Mobile.  “EQ has built a platform focused on data which best helps brands accomplish their goals and we are excited to provide this unique product and its deep behavioral insights to our clients across Canada and the U.S.”","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"As consideration for this transaction, EQ will pay up to $3,500,000 through the issuance of 1,000,000 common shares to the shareholders of Tapped Mobile and additional cash consideration of up to $2,800,000 to be paid out over the following 24 months based on certain performance thresholds being met.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"About Tapped Mobile ","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Tapped Mobile (","marks":[],"data":{}},{"nodeType":"hyperlink","content":[{"nodeType":"text","value":"tappedmobile.com","marks":[],"data":{}}],"data":{"uri":"http://www.tappedmobile.com"}},{"nodeType":"text","value":") is a leading Canadian provider of mobile advertising technology solutions. The company offers Canadian brands a unique approach to mobile marketing by leveraging partnerships with the world’s leading mobile ad technology companies. Tapped Mobile delivers unparalleled ad tech to Canada, including store-level mobile location data; mobile re-targeting; and industry-leading mobile media research. In addition, the company offers traditional display and video advertising across a diverse list of premium and exclusive publishers.     ","marks":[],"data":{}},{"nodeType":"text","value":" ","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"About EQ Works","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":"EQ Works (www.eqworks.com) provides a smarter way to target customers. Using first-party, location-based behaviour signals, advanced data analytics, and proprietary software, EQ creates and targets customized, performance-boosting audience segments. Proprietary algorithms and data generate attribution models that connect consumer behavior in the physical world to consumer behavior in the digital world, solving complex challenges for brands and agencies.","marks":[],"data":{}}],"data":{}},{"nodeType":"hr","content":[],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","marks":[{"type":"italic"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Forward-Looking Statements","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"This news release may contain forward-looking statements that are based on management’s current expectations and are subject to known and unknown uncertainties and risks, which could cause actual results to differ materially from those contemplated or implied by such forward-looking statements.  EQ Inc. is under no obligation to update any forward-looking statements contained herein should material facts change due to new information, future events or otherwise.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ Inc.\n1235 Bay Street, Suite 401| Toronto, Ontario |M5R 3K4\n","marks":[],"data":{}},{"nodeType":"hyperlink","content":[{"nodeType":"text","value":"press@eqworks.com","marks":[],"data":{}}],"data":{"uri":"mailto:press@eqworks.com"}},{"nodeType":"text","value":"\nwww.eqworks.com","marks":[],"data":{}}],"data":{}}]}}},"__N_SSG":true}