{"pageProps":{"pressRelease":{"title":"Leading global book publisher taps EQ Works to help launch 10 new titles for the US market","slug":"book-publisher-taps-eq-to-launch-10-new-titles","excerpt":"EQ Works has been selected by one of the world’s largest book publishers (the “Publisher”) to launch 10 new titles nationally across the United States.","author":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2020-11-11T00:00-05:00","categories":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"nodeType":"document","data":{},"content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Toronto, ON (November 11, 2020) – EQ Inc. (TSXV: EQ) (“EQ Works” or “EQ”), a leader in geospatial location data and intelligence has been selected by one of the world’s largest book publishers (the “Publisher”) to launch 10 new titles nationally across the United States. Book publishing is a multi-billion dollar industry and the pandemic has made it more difficult for businesses to understand and find their target audience. Using LOCUS (EQ’s proprietary data platform), EQ mapped pre-COVID consumer behaviour around 2,500 book retail locations across the United States and identified a high-value audience of over 2 million book enthusiasts. LOCUS then added additional data segments to each of these profiles to better understand the consumer and deliver the most appropriate call to action in support of each book title launch.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"For this initial six figure engagement, the Publisher worked with EQ over multiple quarters to provide better insights into its customer base and targeting strategies in order to reduce the cost of acquisition. While the Pandemic has accelerated consumer preference for ecommerce, historical data on real-world consumer behaviour provides businesses with an understanding of who their highest value customers are and how to move them into the ecommerce pipeline.  EQ’s LOCUS platform, and its ability to marry these insights with data-driven customer acquisition models, resulted in far superior ecommerce results than traditional channels. As consumers adopt new shopping patterns and preferences, businesses need rich, actionable data to understand their changing customer, predict their next move, and influence their behaviour.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"“To generate powerful business outcomes, marketers need to leverage data to drive all elements of their tactical mix” said Joe Strolz, Chief Operating Officer of EQ. “By understanding the data behind the results, we were able to target and influence in a way that would otherwise not be possible.” Using EQ’s award-winning Creative Studio, the Publisher was able to tie deep data insights to interactive digital advertising that outperformed industry standards and helped close the last-mile in referring the consumer to an opportunity to purchase online.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"ABOUT EQ WORKS\n","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":"EQ Works (www.eqworks.com) enables businesses to understand, predict, and influence customer behaviour. Using unique data sets, advanced analytics, machine learning and artificial intelligence, EQ Works creates actionable intelligence for businesses to attract, retain, and grow the customers that matter most. The Company’s proprietary SaaS platform mines insights from movement and geospatial data, enabling businesses to close the loop between digital and real-world consumer actions.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release. ","marks":[{"type":"italic"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Forward-Looking Statements ","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"This news release may contain forward-looking statements that are based on management’s current expectations and are subject to known and unknown uncertainties and risks, which could cause actual results to differ materially from those contemplated or implied by such forward-looking statements. EQ Inc. is under no obligation to update any forward-looking statements contained herein should material facts change due to new information, future events or otherwise.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ Inc. 1235 Bay Street, Suite 401\nToronto, Ontario M5R 3K4","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"press@eqworks.com\nwww.eqworks.com","marks":[],"data":{}}],"data":{}}]}}},"__N_SSG":true}