{"pageProps":{"pressRelease":{"title":"EQ Works and Taco Time Partner to Boost Store Traffic and Increase Market Share from Competition","slug":"eq-works-and-taco-time-partner-to-boost-store","excerpt":"EQ Inc. announced the successful results of their work to better map the consumer journey and drive increased consumer traffic to Taco Time locations.","author":{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2020-08-20T00:00-04:00","categories":[{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Toronto, ON (August 20, 2020) – EQ Inc. (TSXV: EQ) (“EQ Works” or “EQ”), a leader in geospatial location data and intelligence, and Taco Time, providers of great tasting, quality food at an affordable price, announced the successful results of their work to better map the consumer journey and drive increased consumer traffic to Taco Time locations. Powered by EQ’s LOCUS data-insight platform (“LOCUS”), Taco Time developed a deeper understanding of its target consumers, enabling it to better predict behaviour and influence preference for Taco Time versus QSR competitors.  Specifically, the initiative resulted in a 300% increase in visits to Taco Time locations from competitors’ customers.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Projects incorporating advanced AI show powerful insights into consumer behavior profiles by revealing characteristics that lead to outcomes where behavior can be predicted.  This type of analysis is becoming essential for Canada’s leading organizations and, utilizing LOCUS’ AI tools, Taco Time was able to use this data to develop personalized offers to drive and improve business results.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Key Success Drivers:","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Utilizing the AI tools of LOCUS to provide actionable insights and recommendations that drive business results","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Understanding and measuring Taco Time’s customer visitation patterns and that of its competitors","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Developing a comprehensive analysis of Taco Time’s target customers, with detailed visitation data from LOCUS (i.e. busiest days of the week, busiest times of the day, customer home locations, competitor locations, etc.), based on their movement through the physical world","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"},{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Deploying data-driven marketing tactics to best engage with the most desirable customer","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"list-item"}],"nodeType":"unordered-list"},{"data":{},"content":[{"data":{},"marks":[],"value":"‪“With EQ Works, we were able to better understand our customers, and apply these insights for more effective targeting,” said Hayley Ballinger, Director of Marketing, Taco Time. “We were able to understand where consumers started their journey, and if they were loyal to competitors, so that we could plan, design and execute the best way to connect with them. Moving forward, I couldn't imagine creating any sort of marketing plan without this kind of data.”","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"“While the ways in which QSR brands connect with and service their customers are rapidly evolving, the one constant is the consumer,” said Geoffrey Rotstein, President & CEO of EQ Works. “Deeply understanding consumer patterns, and having the tools to predict how they will change, is critical for marketers to move with confidence.”","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"As the physical consumer economy steadily re-opens, data-driven decision-making is more important than ever as established patterns of consumers’ daily routines have been up-ended by COVID-19. At the same time, new patterns in service delivery and consumer preference are evolving. EQ Works offers companies the ability to go back in time to understand real-world consumer patterns prior to the pandemic, during lock-down, and now in the re-opening phase, to understand, predict, and influence consumer behaviour.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"ABOUT EQ WORKS","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Works (","nodeType":"text"},{"data":{"uri":"http://www.eqworks.com/"},"content":[{"data":{},"marks":[],"value":"www.eqworks.com","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":") enables businesses to understand, predict, and influence customer behaviour. Using unique data sets, advanced analytics, machine learning and artificial intelligence, EQ Works creates actionable intelligence for businesses to attract, retain, and grow the customers that matter most. The Company’s proprietary SaaS platform mines insights from movement and geospatial data, enabling businesses to close the loop between digital and real-world consumer actions.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"ABOUT TACO TIME","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Taco Time Canada is committed to providing great tasting, quality food at an affordable price. Our fresh quality ingredients made fresh in-store have kept our loyal customers craving Taco Time for over 40 years.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[],"nodeType":"hr"},{"data":{},"content":[{"data":{},"marks":[],"value":" ","nodeType":"text"},{"data":{},"marks":[{"type":"italic"}],"value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Forward-Looking Statements","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"This news release may contain forward-looking statements that are based on management’s current expectations and are subject to known and unknown uncertainties and risks, which could cause actual results to differ materially from those contemplated or implied by such forward-looking statements.  EQ Inc. is under no obligation to update any forward-looking statements contained herein should material facts change due to new information, future events or otherwise.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Inc.\n1235 Bay Street, Suite 401| Toronto, Ontario |M5R 3K4\npress@eqworks.com\nwww.eqworks.com","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}}},"__N_SSG":true}