{"pageProps":{"pressReleases":[{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4u2MBw0TQV6uZ2BTWSxMq0","type":"Entry","createdAt":"2021-04-15T20:02:16.586Z","updatedAt":"2021-04-15T20:02:16.586Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"post"}},"locale":"en-US"},"fields":{"title":"EQ Inc. Reports Fourth Quarter and Year End Financial Results for 2020","slug":"financial-results-for-2020","excerpt":"Data revenue increases 143% compared to the same period a year ago","author":{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2021-04-15T16:01-04:00","categories":[{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"nodeType":"document","data":{},"content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"TORONTO, ON (April 15, 2021) –","marks":[],"data":{}},{"nodeType":"text","value":" ","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":"EQ Inc. (TSXV: EQ) (“EQ Works” or the “Company”), a leader in geospatial data and artificial intelligence driven software, announced its financial results today for the full year and fourth quarter ended December 31, 2020.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Revenue for the year increased to $10.4 million, an improvement of 16% from the $9.0 million recorded in the previous year. Revenue for the fourth quarter of 2020 was $3.6 million, an increase of 27% from the same period a year ago and an increase of 28% over the third quarter of 2020.  Data revenue also increased by 95% annually to $2.5 million, and by 143% compared to the same period a year ago, as the number and size of data engagements increased over the course of the year. The adjusted EBITDA loss for the quarter was approximately $0.1 million, consistent with the third quarter of 2020 and the previous year, as the Company continued to invest in infrastructure, unique data assets and its proprietary geospatial platforms. ","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"“We are very pleased with our results for 2020 and especially with the resilience of our data business during what was a very difficult year” said Geoffrey Rotstein, President and CEO of EQ Works. “Our platforms are designed to help businesses understand consumer behavior and make better strategic decisions. As we have seen over the last 12 months, data is becoming an essential component of every business decision and our ability to provide unique solutions continues to gain momentum.”","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Highlights for the Fourth Quarter and Year ended December 31, 2020","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"unordered-list","content":[{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Increased annual revenue by 16% year over year;","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Increased quarterly revenue by 27% compared to the fourth quarter of 2019;","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Increased data revenue by 143% compared to the same period last year and by 95% for the fiscal year 2020;","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"7th consecutive quarter of growth in data revenue; ","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Acquired Juice Mobile to further strengthen EQ’s data assets and marketing relationships;","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Cash balance at the end of the year was $3.2 million with positive net working capital of $2.6 million; ","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Increased its operating line of credit with one of Canada’s major banks to $1.6 million; and","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Subsequent to the end of the year, the Company completed an equity financing for an additional $11.5 million.","marks":[],"data":{}}],"data":{}}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"The Company continued to show growth from its data division. A continued focus on driving business results from data, analytics, artificial intelligence, predictive modelling and machine learning has continued to generate interest and demand for the Company’s products. ","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Non-IFRS Financial Measures ","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":"\r","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ Works measures the success of the Company’s strategies and performance based on Adjusted EBITDA, which is outlined and reconciled with net income (loss) in the section entitled “Reconciliation of Net Loss for the period to Adjusted EBITDA” in the MD&A. The Company defines Adjusted EBITDA as net income (loss) from operations before: (a) depreciation of property and equipment and amortization of intangible assets, (b) share-based payments, (c) finance income and costs, net, and (d) depreciation of right-of-use assets (e) additional contingent consideration (f) transaction costs of acquisition (g) impairment of goodwill and intangible assets. Management uses Adjusted EBITDA as a measure of the Company's operating performance because it provides information on the Company's ability to provide operating cash flows for working capital requirements, capital expenditures, and potential acquisitions. The Company also believes that analysts and investors use Adjusted EBITDA as a supplemental measure to evaluate the overall operating performance of companies in its industry. \r","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"The non-IFRS financial measure is used in addition to, and in conjunction with, results presented in the Company’s consolidated financial statements prepared in accordance with IFRS and should not be relied upon to the exclusion of IFRS financial measures. Management strongly encourages investors to review the Company's consolidated financial statements in their entirety and to not rely on any single financial measure. Because non-IFRS financial measures are not standardized, it may not be possible to compare these financial measures with other companies' non-IFRS financial measures having the same or similar names. In addition, the Company expects to continue to incur expenses similar to the non-IFRS adjustments described above, and exclusion of these items from the Company's non-IFRS measures should not be construed as an inference that these costs are unusual, infrequent, or non-recurring.\r\nThe table below reconciles net loss from operations and Adjusted EBITDA for the periods presented:\n","marks":[],"data":{}}],"data":{}},{"nodeType":"embedded-asset-block","content":[],"data":{"target":{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"3GKuZCWhSpYQIEPbTPAMRR","type":"Asset","createdAt":"2021-04-15T18:15:45.745Z","updatedAt":"2021-04-15T18:15:45.746Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"locale":"en-US"},"fields":{"title":"Adjusted EBITDA for three and twelve months","description":"Adjusted EBITDA results for three and twelve months ended December 31, 2020 and 2019","file":{"url":"//images.ctfassets.net/nph7if1oawhd/3GKuZCWhSpYQIEPbTPAMRR/3837bccfdace176656182c91144f2ee2/Screen_Shot_2021-04-15_at_2.14.27_PM.png","details":{"size":154750,"image":{"width":1200,"height":650}},"fileName":"Screen Shot 2021-04-15 at 2.14.27 PM.png","contentType":"image/png"}}}}},{"nodeType":"hr","content":[],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"About EQ Works","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":"\r","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ Works (www.eqworks.com) enables businesses to understand, predict, and influence customer behaviour. Using unique data sets, advanced analytics, machine learning and artificial intelligence, EQ Works creates actionable intelligence for businesses to attract, retain, and grow the customers that matter most. The Company’s proprietary SaaS platform mines insights from movement and geospatial data, enabling businesses to close the loop between digital and real-world consumer actions.\r","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\r","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","marks":[{"type":"italic"}],"data":{}},{"nodeType":"text","value":"\r","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Forward-Looking Statements","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":"\r","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Certain statements contained in this press release constitute “forward-looking statements”. All statements other than statements of historical fact contained in this press release, including, without limitation, those regarding the Company’s future financial position and results of operations, strategy, plans, objectives, goals and targets, and any statements preceded by, followed by or that include the words “believe”, “expect”, “aim”, “intend”, “plan”, “continue”, “will”, “may”, “would”, “anticipate”, “estimate”, “forecast”, “predict”, “project”, “seek”, “should” or similar expressions, or the negative thereof, are forward-looking statements. These statements are not historical facts but instead represent only the Company’s expectations, estimates, and projections regarding future events. These statements are not guarantees of future performance and involve assumptions, risks, and uncertainties that are difficult to predict. Therefore, actual results may differ materially from what is expressed, implied, or forecasted in such forward-looking statements. Additional factors that could cause actual results, performance, or achievements to differ materially include, but are not limited to, the risk factors discussed in the Company’s MD&A for the year ended December 31, 2020. Management provides forward-looking statements because it believes they provide useful information to investors when considering their investment objectives but cautions investors not to place undue reliance on forward-looking information. Consequently, all of the forward-looking statements made in this press release are qualified by these cautionary statements and any other cautionary statements or factors contained herein, and there can be no assurance that the actual results or developments will be realized or, even if substantially realized, that they will have the expected consequences to, or effects on, the Company. These forward-looking statements are made as of the date of this press release, and the Company assumes no obligation to update or revise them to reflect subsequent information, events, or circumstances or otherwise, except as required by law.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ Inc, ","marks":[{"type":"bold"}],"data":{}},{"nodeType":"hyperlink","content":[{"nodeType":"text","value":"www.eqworks.com","marks":[],"data":{}}],"data":{"uri":"http://www.eqworks.com"}},{"nodeType":"text","value":" ","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Peter Kanniah, Chief Financial Officer – 416-260-4326  •  1235 Bay Street, Suite 401 Toronto, Ontario M5R 3K4","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Bill Mitoulas, Investor Relations – 416-479-9547  •  ","marks":[],"data":{}},{"nodeType":"hyperlink","content":[{"nodeType":"text","value":"press@eqworks.com","marks":[],"data":{}}],"data":{"uri":"mailto:press@eqworks.com"}},{"nodeType":"text","value":"","marks":[],"data":{}}],"data":{}}]}}},{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"5xv0wj4nRvv0JIJpnPa7Si","type":"Entry","createdAt":"2021-03-10T13:17:17.630Z","updatedAt":"2021-03-10T13:19:29.369Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":2,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"post"}},"locale":"en-US"},"fields":{"title":"EQ Works launches Canada’s first Geospatial Cohort-Based Audience Platform","slug":"eq-launches-first-geospatial-cohort-based-platform","excerpt":"Combining AI and Geospatial data to enable marketers to thrive in a privacy focused world.","author":{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2021-03-10T08:15-05:00","categories":[{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"6BRj1Px2UxDrMTMNgfe73p","type":"Entry","createdAt":"2020-09-03T14:59:44.624Z","updatedAt":"2020-09-03T14:59:44.624Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Audience Building"}},{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Toronto, ON (March 10, 2021) – EQ Inc. (TSXV: EQ) (“EQ Works” or “EQ”), a leader in geospatial data and artificial intelligence (“AI”) is pleased to announce the launch of ATOM NEXT, the first Canadian geospatial cohort-based audience platform.  Derived from over a petabyte of Canadian consumer geospatial data from EQ’s data platform (LOCUS), ATOM NEXT enables marketers to reach their target audiences with confidence and precision in a\nprivacy-focused world.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"While the abundance of available data has fueled the growth of digital advertising as a one-to-one medium, for the last five years EQ has been steadily preparing for a world of data changes by investing in data science, machine learning, and AI technologies and capabilities. “Training AI models requires time and data, it cannot be done overnight,” said Dilshan Kathriarachchi, Chief Technology Officer of EQ Works. “We set out initially to build a set of technologies that made the most out of geospatial data -- which is the greatest predictor of consumer propensities and behaviors.  Geospatial data is inherently cohort based - where people live, work, shop, and play - which is now proving to be more valuable to marketers than ever before.”","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"“ATOM NEXT is perfectly positioned to meet the needs of the advertising world as it moves to more of a cohort model of audience targeting” said Joe Strolz, Chief Operating Officer of\nEQ Works. “Cohort models protect user privacy by aggregating them into larger, more anonymized groups. Marketers need tools that provide high-confidence predictions about the relevance of one audience cohort versus another, which is what our machine learning and AI models have been trained to solve.”","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Technology changes that are underway with Google’s Chrome and Android platforms and Apple’s iOS and Safari systems are changing the way the advertising industry operates. ATOM NEXT provides the tools and technology to execute cohort- based strategies that\nallow marketers to continue to deliver the right consumer, with the right message, at the right time.  With technology rapidly changing and privacy becoming a primary focus, ATOM NEXT is proving to be a powerful tool for marketers working with brands and agencies to address their needs as the landscape continues to evolve. ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Engagement of Investor Relations Consultant:","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The Company is also pleased to announce that, subject to the approval of the TSX Venture Exchange (the “Exchange”), it has entered into a consulting agreement with Venture North\nCapital Inc. (“Venture North”) to provide strategic marketing, investor relations and business consulting services. Venture North is a Toronto based capital markets consulting firm specializing in executing strategic investor outreach campaigns.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The agreement with Venture North has an initial term of 6-months and, if renewed, will be automatically renewed for 3-month terms until such time as it is terminated on 60 days’\nnotice. Pursuant to the terms of the consulting agreement, the Company will pay a monthly cash fee of $7,000 (plus HST) and has agreed to issue 100,000 options to purchase common shares of the Company (“Common Shares”), with an exercise price at $1.75. Of the options issued to Venture North, 25,000 shall vest immediately and an additional 25,000 options will vest quarterly in arrears.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[],"nodeType":"hr"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"ABOUT EQ WORKS:","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Works (www.eqworks.com) enables businesses to understand, predict, and influence customer behaviour. Using unique data sets, advanced analytics, machine learning and artificial intelligence, EQ Works creates actionable intelligence for businesses to attract,\nretain, and grow the customers that matter most. The Company’s proprietary SaaS platform mines insights from movement and geospatial data, enabling businesses to close the loop between digital and real-world consumer actions. ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"italic"}],"value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Forward-Looking Statements","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"This news release may contain forward-looking statements that are based on management’s current expectations and are subject to known and unknown uncertainties and risks, which could cause actual results to differ materially from those contemplated or implied by such forward-looking statements.  The Corporation is under no obligation to update any forward-looking statements contained herein should material facts change due to new information, future events or otherwise.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"EQ Inc ","nodeType":"text"},{"data":{},"marks":[],"value":"Peter Kanniah, Chief Financial Officer  •   416.260.4326  •  press@eqworks.com","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"EQ Inc ","nodeType":"text"},{"data":{},"marks":[],"value":"Bill Mitoulas, Investor Relations   •   416.479.9547  •  investor@eqworks.com","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}}},{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"7cU3SZ2Kc9af6eKLMMsrwb","type":"Entry","createdAt":"2021-02-25T13:31:40.990Z","updatedAt":"2021-02-25T13:31:40.991Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"post"}},"locale":"en-US"},"fields":{"title":"EQ Works announces AI-powered data marketing solution for the Insurance Industry in partnership with OPTA Information Intelligence","slug":"ai-powered-data-marketing-solution-for-insurance","excerpt":"Platform can deliver up to 60% savings in customer acquisition costs and significant growth in conversion of highest value customers.","author":{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2021-02-25T09:00-05:00","categories":[{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"nodeType":"document","data":{},"content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Toronto, ON (February 25, 2021) – EQ Inc. (TSXV: EQ) (“EQ Works” or “EQ”), a leader in geospatial location data and artificial intelligence is pleased to announce its partnership with Opta Information Intelligence (Opta), Canada’s largest property location intelligence provider, to deliver a first-of-its-kind digital marketing solution for the Canadian Insurance industry.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Opta Digital Edge combines EQ’s artificial intelligence (“AI”) and machine learning technology with proprietary Opta and EQ consumer data sets, to help insurance providers find their ideal target customers with scale and precision.  A recent proof of concept with a digital insurance company in Canada resulted in a 60% reduction of acquisition costs and a 3-5x improvement in new client conversion.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"“A key part of EQ’s data solution is to enable the seamless onboarding of a companies’ first-party and CRM data at scale,” said Dilshan Kathriarachchi, Chief Technology Officer of EQ Works. “Today’s businesses need privacy-first solutions and flexible tools that allow companies to augment their own data with additional signals and train AI models specific to their unique needs. This is where we are focusing as a company, and the business results speak for themselves.”","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"“We could see dramatic improvements in attracting new business at very competitive acquisition costs. By working with EQ, we were able to add proprietary attributes which dramatically changed the growth curve. We’re confident we’ve cracked the code of linking sales growth with profitability and are looking forward to sharing this with more clients over the next year,” said Greg Purdy, Director of Firmography at Opta.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"This unique industry solution provides insurers with layered insights to identify the characteristics of an ideal customer and precisely locate all their digital twins in any geographic region across Canada. Leveraging CONNECTION HUB, EQ’s data onboarding bridge, Opta Digital Edge integrates Opta’s Peril Score into the audience building process enhancing the quality and effectiveness of the data in driving conversions with the right consumers.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"“Helping company’s get the most out of their data is an essential first step in a data driven economy” said Geoffrey Rotstein, President and CEO of EQ Works. “Utilizing EQ’s AI and machine learning models and enriched data sets, our solutions help significantly reduce customer acquisition costs and drive growth in customers with the highest life-time value.”","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"ABOUT EQ WORKS:","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ Works(www.eqworks.com) enables businesses to understand, predict, and influence customer behaviour. Using unique data sets, advanced analytics, machine learning and artificial intelligence, EQ Works creates actionable intelligence for businesses to attract, retain, and grow the customers that matter most. The Company’s proprietary SaaS platform mines insights from movement and geospatial data, enabling businesses to close the loop between digital and real-world consumer actions.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"ABOUT OPTA:","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Opta provides insurance and corporate clients with tools and information to help manage and authenticate risk information, in turn helping them discover and explore business opportunities, become more competitive, generate business and gain the insight required to make profitable business decisions.","marks":[],"data":{}}],"data":{}},{"nodeType":"hr","content":[],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","marks":[{"type":"italic"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Forward-Looking Statements","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"This news release may contain forward-looking statements that are based on management’s current expectations and are subject to known and unknown uncertainties and risks, which could cause actual results to differ materially from those contemplated or implied by such forward-looking statements.  The Corporation is under no obligation to update any forward-looking statements contained herein should material facts change due to new information, future events or otherwise.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ Inc.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Peter Kanniah, Chief Financial Officer","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"416-260-4326  ","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"1235 Bay Street, Suite 401| Toronto, Ontario |M5R 3K4","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"press@eqworks.com","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"www.eqworks.com","marks":[],"data":{}}],"data":{}}]}}}]},"__N_SSG":true}