{"pageProps":{"pressRelease":{"title":"EQ Inc. Reports 53% Year over Year Revenue Growth","excerpt":"EQ Inc. announced its financial results today for the full year and fourth quarter ended December 31, 2019.","author":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2020-04-27T00:00-04:00","slug":"eq-inc-reports-53-year-over-year-revenue-growth","categories":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"nodeType":"document","data":{},"content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"TORONTO, ON (April 27, 2020) -","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":" EQ Inc. (TSXV: EQ) (“EQ Works” or the “Company”), a leader in geospatial data and intelligence, announced its financial results today for the full year and fourth quarter ended December 31, 2019.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Revenue for the year increased to $9.0 million, an improvement of 53% from the $5.9 million recorded in the previous year. Revenue for the fourth quarter of 2019 was $2.9 million, an increase of 27% from the same period a year ago and an increase of 16% over the third quarter of 2019.  The Company added 62 new clients during the year and increased the number of campaigns by over 100%. Data revenue also increased by 73% as the number and size of data engagements increased over the course of the year. The adjusted EBITDA loss for the quarter was approximately $0.1 million, consistent with the third quarter of 2019 as the Company continued to invest in infrastructure, unique data assets and its proprietary geospatial platforms.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Highlights for the Fourth Quarter and Year ended December 31, 2019","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"unordered-list","content":[{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Annual revenue increased by 53% compared to the same period a year ago","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Quarterly revenue increased by 27% compared to the fourth quarter of 2018","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Data revenue increased by 73%","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Completed equity financings for a total of $5.2 million","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Added 62 new high-value clients","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"New Data Management Platform (“DMP”) integrations allowing for EQ segments to be exported to hundreds of external media and data platforms","marks":[],"data":{}}],"data":{}}],"data":{}},{"nodeType":"list-item","content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Three new data partners were integrated during the quarter onto the LOCUS marketplace","marks":[],"data":{}}],"data":{}}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"\"We are pleased with our growth in 2019, but even more excited about the expansion of our data business and how well it complements our other divisions,” said Geoffrey Rotstein, President and CEO of EQ Works. “Our proprietary technology platforms have evolved significantly over the year and by incorporating new machine learning and artificial intelligence algorithms, client performance has continued to improve.”","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Subsequent to the end of the year, the Company, as with all other companies in Canada, has been dealing with the effects of COVID-19. Although there has been some impact to the advertising side of the business, data and insights engagements have not been impacted to the same extent. The Company believes that based on its current business outlook, the $5.2 million financing completed at the end of 2019, diligent cost cutting measures and the difficult decision to furlough certain employees, it is well positioned to work through this pandemic. The Company will continue to monitor its business outlook and make additional changes if required.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Non-IFRS Financial Measures ","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ Works measures the success of the Company’s strategies and performance based on Adjusted EBITDA, which is outlined and reconciled with net income (loss) in the section entitled “Reconciliation of Net Loss for the period to Adjusted EBITDA” in the MD&A. The Company defines Adjusted EBITDA as net income (loss) from operations before: (a) depreciation of property and equipment and amortization of intangible assets, (b) share-based payments, (c) finance income and costs, net, and (d) depreciation of right-of-use assets (e) additional contingent consideration (f) transaction costs of acquisition. Management uses Adjusted EBITDA as a measure of the Company's operating performance because it provides information on the Company's ability to provide operating cash flows for working capital requirements, capital expenditures, and potential acquisitions. The Company also believes that analysts and investors use Adjusted EBITDA as a supplemental measure to evaluate the overall operating performance of companies in its industry.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"The non-IFRS financial measure is used in addition to, and in conjunction with, results presented in the Company’s consolidated financial statements prepared in accordance with IFRS and should not be relied upon to the exclusion of IFRS financial measures. Management strongly encourages investors to review the Company's consolidated financial statements in their entirety and to not rely on any single financial measure. Because non-IFRS financial measures are not standardized, it may not be possible to compare these financial measures with other companies' non-IFRS financial measures having the same or similar names. In addition, the Company expects to continue to incur expenses similar to the non-IFRS adjustments described above, and exclusion of these items from the Company's non-IFRS measures should not be construed as an inference that these costs are unusual, infrequent, or non-recurring.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"The table below reconciles net loss from operations and Adjusted EBITDA for the periods presented:","marks":[],"data":{}}],"data":{}},{"nodeType":"embedded-asset-block","content":[],"data":{"target":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2wpqO37xjI8RzL1u7VN6Jr","type":"Asset","createdAt":"2020-09-03T18:12:38.860Z","updatedAt":"2020-09-03T18:31:29.859Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"Financials - 2019 Q4","description":"Financials - 2019 Q4","file":{"url":"//images.ctfassets.net/nph7if1oawhd/2wpqO37xjI8RzL1u7VN6Jr/11b1859d6d15110ae16ab0baff3cd65f/4rthqtr2019.jpg","details":{"size":51235,"image":{"width":656,"height":358}},"fileName":"4rthqtr2019.jpg","contentType":"image/jpeg"}}}}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"About EQ Works","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ Works (www.eqworks.com) provides a smarter way to target customers. Using first-party, location-based behaviour signals, advanced data analytics, and proprietary software, EQ creates and targets customized, performance-boosting audience segments. Proprietary algorithms and data generate attribution models that connect consumer behaviour in the physical world to consumer behaviour in the digital world, solving complex challenges for brands and agencies.","marks":[],"data":{}}],"data":{}},{"nodeType":"hr","content":[],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":" ","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","marks":[{"type":"italic"}],"data":{}},{"nodeType":"text","value":" ","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Forward-Looking Statements","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Certain statements contained in this press release constitute “forward-looking statements”. All statements other than statements of historical fact contained in this press release, including, without limitation, those regarding the Company’s future financial position and results of operations, strategy, plans, objectives, goals and targets, and any statements preceded by, followed by or that include the words “believe”, “expect”, “aim”, “intend”, “plan”, “continue”, “will”, “may”, “would”, “anticipate”, “estimate”, “forecast”, “predict”, “project”, “seek”, “should” or similar expressions, or the negative thereof, are forward-looking statements. These statements are not historical facts but instead represent only the Company’s expectations, estimates, and projections regarding future events. These statements are not guarantees of future performance and involve assumptions, risks, and uncertainties that are difficult to predict. Therefore, actual results may differ materially from what is expressed, implied, or forecasted in such forward-looking statements. Additional factors that could cause actual results, performance, or achievements to differ materially include, but are not limited to, the risk factors discussed in the Company’s MD&A for the three and year ended December 31, 2019. Management provides forward-looking statements because it believes they provide useful information to investors when considering their investment objectives but cautions investors not to place undue reliance on forward-looking information. Consequently, all of the forward-looking statements made in this press release are qualified by these cautionary statements and any other cautionary statements or factors contained herein, and there can be no assurance that the actual results or developments will be realized or, even if substantially realized, that they will have the expected consequences to, or effects on, the Company. These forward-looking statements are made as of the date of this press release, and the Company assumes no obligation to update or revise them to reflect subsequent information, events, or circumstances or otherwise, except as required by law.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ Inc.\n1235 Bay Street, Suite 401| Toronto, Ontario |M5R 3K4\n","marks":[],"data":{}},{"nodeType":"hyperlink","content":[{"nodeType":"text","value":"press@eqworks.com","marks":[],"data":{}}],"data":{"uri":"mailto:press@eqworks.com"}},{"nodeType":"text","value":"\nwww.eqworks.com","marks":[],"data":{}}],"data":{}}]}}},"__N_SSG":true}