{"pageProps":{"pressRelease":{"title":"EQ Inc. Announces Early Exercise of Warrants and New Credit Facility","slug":"eq-inc-announces-early-exercise-of-warrants","excerpt":"EQ Inc. announce the expected closing of additional financing of approximately $5 million as a result of the exercise of warrants.","author":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2020-07-09T00:00-04:00","categories":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"TORONTO, ON (July 9, 2020) - EQ Inc. (TSXV: EQ) (“EQ Works” or the “Company”), a leader in geospatial data and intelligence, is pleased to announce the expected closing of  additional financing of approximately $5 million as a result of the exercise of warrants and a new credit facility with one of Canada’s major banks. These two sources of additional capital further strengthen the Company’s balance sheet, enabling it to accelerate development of its industry leading data platform, speed expansion into new industries and geographies, and lead with innovation to help the economy safely reopen and protect Canadians during and after the COVID-19 pandemic.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Approximately $3.3 million (CAD) was raised from the early exercise of warrants which had been part of the December 2019 financing (the “Warrants”).  On May 29, 2020, the Company announced the acceleration and new expiry date for the Warrants resulting in almost 100% of the Warrants being exercised at a price of $1.00 per share.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The Company is also close to closing a new $1.6 million revolving credit facility (the “Facility”) with one of Canada’s largest banks. The Facility will bear interest at prime plus 2.5% per annum.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"“We set aggressive targets for 2020 and we have more than the necessary financial resources to execute our plan,” said Geoffrey Rotstein, CEO of EQ Works. “Even with all the market challenges over the last few months, our data platform continued to evolve and strengthen, our business expanded into new verticals and geographies, and we continue to utilize our data assets and expertise on COVID-19 related modelling and technology development with various partners.”","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Works continues to gain traction with advertisers and marketers to prepare for the challenges of a post-pandemic world in which actionable AI-driven insights will be a primary driver of business outcomes.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"About EQ Works","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Works (","nodeType":"text"},{"data":{"uri":"http://www.eqworks.com/"},"content":[{"data":{},"marks":[],"value":"www.eqworks.com","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":") enables businesses to understand, predict, and influence customer behaviour. Using proprietary data sets, advanced analytics, machine learning and artificial intelligence, EQ Works creates actionable intelligence for businesses to attract, retain, and grow the customers that matter most. The Company’s proprietary SaaS platform mines insights from movement and geospatial data, enabling businesses to close the loop between digital and real-world consumer actions.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[],"nodeType":"hr"},{"data":{},"content":[{"data":{},"marks":[{"type":"italic"}],"value":"Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":" ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Forward-Looking Statements ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"This news release contains forward-looking statements, which may include, without limitation, statements with respect to the use of proceeds from the exercise of Warrants and the Facility. The forward-looking statements are based on management’s current expectations and/or assumptions, and are subject to known and unknown uncertainties and risks, which could cause actual results to differ materially from those contemplated or implied by such forward-looking statements.  When used in this press release, the words “estimate”, “project”, “belief”, “anticipate”, “intend”, “expect”, “plan”, “predict”, “may” or “should” and the negative of these words or such variations thereon or comparable terminology are intended to identify forward-looking statements.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"By their nature, forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause our actual results, performance or achievements, or other future events, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. Such factors include, among other things, the demand for EQ Works’ products and services; a history of net losses; restructuring; intellectual property actions; credit risk from trade credit; changing nature of internet and mobile advertising; failure of real-time advertising exchanges to attract publishers; government regulation of the internet; system failures; competition from new customers and products; rapid technological change; lengthy sales cycles hindering adoption of EQ Works’ solutions; third-party claims related to content in advertising delivered by EQ Works; as well as those factors disclosed in the Company's publicly filed documents. This list is not exhaustive of the factors that may affect any of the Company’s forward-looking statements. These and other factors should be considered carefully and readers should not place undue reliance on the Company’s forward-looking statements.  The Company undertakes no obligation to update any forward-looking statements (unless required by law) contained herein should material facts change due to new information, future events or otherwise.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Inc.\n1235 Bay Street, Suite 401| Toronto, Ontario |M5R 3K4\np: 416.597.8889\n","nodeType":"text"},{"data":{"uri":"mailto:press@eqworks.com"},"content":[{"data":{},"marks":[],"value":"press@eqworks.com","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":"\nwww.eqworks.com\nContact: Peter Kanniah, Chief Financial Officer","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}}},"__N_SSG":true}