{"pageProps":{"pressRelease":{"title":"EQ WORKS SIGNS MULTI-YEAR DEAL WITH LEADING OUT-OF-HOME COMPANY","slug":"eq-works-signs-multi-year-deal-with-leading","excerpt":"EQ Inc. announced a multi-year engagement with one of Canada’s largest out-of-home (“OOH”) advertising companies.","author":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2020-05-12T00:00-04:00","categories":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"Toronto, ON (May 12, 2020) – EQ Inc. (TSXV: EQ) (“EQ Works”, “EQ” or the “Corporation”), a leader in geospatial location data and intelligence, is proud to announce a multi-year engagement with one of Canada’s largest out-of-home (“OOH”) advertising companies (the “Company”).","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The engagement will utilize EQ’s data and proprietary technology to enrich the OOH experience for advertisers by providing measurement statistics, attribution tools, and unique research, insights and re-targeting at scale.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ was selected after a rigorous evaluation process that involved multiple vendors from across North America. “The strength of EQ’s unique data and its sophisticated location-oriented technology platform were the deciding factors in our partnership.” said Mark Ditkofsky, VP Business Development and Strategic Partnerships of EQ Works. “We are excited to be working with such an iconic media company and will continue to innovate to provide even more value to OOH advertising companies.”","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ will also utilize its audience scaling and data export tools to enrich the Company’s programmatic OOH offering. Combining these distribution sources along with a streamlined data set from EQ’s location platform, will create an even stronger value proposition.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"“It was clear that EQ had the expertise, scale and deep toolset we needed to drive value for our advertisers. We feel very confident in our selection and are excited about how EQ’s technology solutions will enable our teams to work closer with brands and agencies.” said Company's Director of Technology.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"“Supporting OOH solutions is a natural progression for our proprietary data and technology platforms and this partnership is an important step.” said Geoffrey Rotstein, President and CEO of EQ Works. “Measurement and attribution are essential tools for all businesses, and it’s nice to have our technology and our team be recognized by one of the largest players in the country.”","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"OOH is an advertising medium that reaches people outside of their homes through digital and static formats.  It includes billboards, transit shelters, elevator monitors and other formats and represents approximately 10 billion dollars in ad spend annually in Canada and the US.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"About EQ Works","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Works (","nodeType":"text"},{"data":{"uri":"http://www.eqworks.com/"},"content":[{"data":{},"marks":[],"value":"www.eqworks.com","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":") provides a smarter way to target customers. Using first-party, location-based behaviour signals, advanced data analytics, and proprietary software, EQ creates and targets customized, performance-boosting audience segments. Proprietary algorithms and data generate attribution models that connect consumer behaviour in the physical world to consumer behaviour in the digital world, solving complex challenges for brands and agencies.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[],"nodeType":"hr"},{"data":{},"content":[{"data":{},"marks":[{"type":"italic"}],"value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts\nresponsibility for the adequacy or accuracy of this release.","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":" ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Forward-Looking Statements","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"italic"}],"value":"This news release may contain forward-looking statements that are based on management’s current expectations and are subject to known and unknown uncertainties and risks, which could cause actual results to differ materially from those contemplated or implied by such forward-looking statements. EQ Inc. is under no obligation to update any forward-looking statements contained herein should material facts change due to new information, future events or otherwise.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}}},"__N_SSG":true}