{"pageProps":{"pressRelease":{"title":"EQ Works Enters into $1.5 Million Partnership with Leading Franchise Group","slug":"eq-works-enters-into-usd1-5-million-partnership","excerpt":"EQ Inc. is proud to announce a $1.5 million mobile data and advertising partnership with a very prominent franchise group.","author":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2019-02-07T00:00-04:00","categories":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Toronto, ON (February 7, 2019)","nodeType":"text"},{"data":{},"marks":[],"value":" - EQ Inc. (TSXV: EQ) (“EQ Works”, “EQ” or the “Company”), North America’s leader in location behaviour data and intelligence, is proud to announce a $1.5 million mobile data and advertising partnership with a very prominent franchise group. The contract represents a significant step forward for EQ as brands and agencies leverage EQ’s data to improve the targeting and understanding of their customers, and to enhance insights and improve overall digital campaign effectiveness.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"“We have the unique ability to combine our first-party location-based behaviour signals with advanced data analytics capabilities in ways that can be really powerful for the franchises. Being able to connect consumer behaviour in the physical world to behaviour in the digital world is critical to their digital marketing strategy”, said Jed Schneiderman, EVP of Growth and Marketing. “We’re really thrilled to support their customer-centric vision by helping their brands reach the right people when their services are needed the most.”","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"In the past year, this franchise group’s vision has been extremely successful with multi-brand consumer penetration increasing substantially. In order to support this rapid growth while remaining responsive to customer needs, the group has chosen EQ as a digital partner. “Our highly targeted segments and location data technology, through our proprietary Locus platform, allows us to help brands identify and understand target geographic areas of focus.” said Geoffrey Rotstein, President and CEO. EQ’s sophisticated campaign reporting metrics will allow brands to accurately evaluate the performance of their marketing and optimize campaigns more effectively in the future.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"About EQ Works","nodeType":"text"},{"data":{},"marks":[],"value":"\nEQ Works (www.eqworks.com) provides a smarter way to target customers. Using first-party, location-based behaviour signals, advanced data analytics, and proprietary software, EQ creates and targets customized, performance-boosting audience segments. Proprietary algorithms and data generate attribution models that connect consumer behavior in the physical world to consumer behavior in the digital world, solving complex challenges for brands and agencies.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[],"nodeType":"hr"},{"data":{},"content":[{"data":{},"marks":[{"type":"italic"}],"value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Forward-Looking Statements","nodeType":"text"},{"data":{},"marks":[],"value":"\nThis news release may contain forward-looking statements that are based on management’s current expectations and are subject to known and unknown uncertainties and risks, which could cause actual results to differ materially from those contemplated or implied by such forward-looking statements. EQ Inc. is under no obligation to update any forward-looking statements contained herein should material facts change due to new information, future events or otherwise.\n","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"EQ Inc.","nodeType":"text"},{"data":{},"marks":[],"value":"\n1235 Bay Street, Suite 401| Toronto, Ontario |M5R 3K4\npress@eqworks.com\nwww.eqworks.com","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}}},"__N_SSG":true}