{"pageProps":{"pressRelease":{"title":"EQ Works Signs Multi-Year Engagement","excerpt":"This relationship will combine the richest data sets in Canada with EQ’s data focused proprietary platform to provide marketers and advertisers with best-in-class and unique targeting and measurement tools.","author":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2019-12-05T00:00-04:00","slug":"eq-works-signs-multi-year-engagement","categories":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"nodeType":"document","data":{},"content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Toronto, ON (December 5, 2019)","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":" - EQ Inc. (TSXV: EQ) (“EQ Works”, “EQ” or the “Company”), North America’s leader in location behaviour data and intelligence, is proud to announce a multi-year engagement with one of Canada’s largest corporations (the “Corporation”). This relationship will combine the richest data sets in Canada with EQ’s data focused proprietary platform to provide marketers and advertisers with best-in-class and unique targeting and measurement tools. EQ was chosen ahead of multiple other Canadian and US firms because of its focus on data and its ability to implement solutions that are understood, effective and actionable.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"“We are excited to embark on this new partnership.” said Mark Ditkofsky, VP Business Development of EQ Works. “With EQ providing audience creation tools, attribution measurement and targeted media buying to their already rich source of first-party data we will be able to deliver unprecedented levels of targeting and measurement at both local and national levels.”","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ will also utilize its proprietary audience segmentation tools to create an even stronger value proposition through enhanced custom audience building, store visitation and other forms of targeted mobile media buying.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"“After a thorough evaluation process it was clear that EQ had the tools, teams and expertise to assist us in fully leveraging and executing our data-first strategy across business units” said the Corporation’s Director of Data Monetization. “We are excited to be working with the EQ team as we continue to offer industry leading data and media solutions to our clients.”","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"“We are thrilled with the opportunity to work with one of Canada’s leading Corporations.” said Geoffrey Rotstein, President and CEO of EQ Works. “Our team has worked extremely hard to build a world-class platform and it is rewarding to be recognized in this capacity by such a well respected organization.”","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"About EQ Works","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ Works (www.eqworks.com) provides a smarter way to target customers. Using first-party, location-based behaviour signals, advanced data analytics, and proprietary software, EQ creates and targets customized, performance-boosting audience segments. Proprietary algorithms and data generate attribution models that connect consumer behavior in the physical world to consumer behavior in the digital world, solving complex challenges for brands and agencies.","marks":[],"data":{}}],"data":{}},{"nodeType":"hr","content":[],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","marks":[{"type":"italic"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Forward-Looking Statements","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"This news release may contain forward-looking statements that are based on management’s current expectations and are subject to known and unknown uncertainties and risks, which could cause actual results to differ materially from those contemplated or implied by such forward-looking statements.  EQ Inc. is under no obligation to update any forward-looking statements contained herein should material facts change due to new information, future events or otherwise.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"EQ Inc.\n1235 Bay Street, Suite 401| Toronto, Ontario |M5R 3K4\n","marks":[],"data":{}},{"nodeType":"hyperlink","content":[{"nodeType":"text","value":"press@eqworks.com","marks":[],"data":{}}],"data":{"uri":"mailto:press@eqworks.com"}},{"nodeType":"text","value":"\nwww.eqworks.com","marks":[],"data":{}}],"data":{}}]}}},"__N_SSG":true}