{"pageProps":{"pressRelease":{"title":"EQ Works Pre-Announces Q4 2018 and Provides Year End Unaudited Financial Guidance","slug":"eq-works-pre-announces-q4-2018-and-provides","excerpt":"EQ Inc. is pleased to provide preliminary unaudited financial guidance for the fourth quarter and year ended December 31, 2018.","author":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2019-03-28T00:00-04:00","categories":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Toronto, ON (March 28, 2019) - EQ Inc. (TSXV: EQ) (“EQ Works”, “EQ” or the “Company”),","nodeType":"text"},{"data":{},"marks":[],"value":" North America’s leader in location behaviour data and intelligence, is pleased to provide preliminary unaudited financial guidance for the fourth quarter and year ended December 31, 2018.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The Company expects to report revenue for the fourth quarter of approximately $2.3 million, an increase of 62% over the third quarter of 2018 and an increase of 39% from the same period a year ago. The Company also expects to generate a positive adjusted EBITDA for the quarter. These results were a substantial improvement from both the previous quarter and from the same quarter a year ago.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Total revenue for the year is expected to increase by 6% to approximately $5.9 million, from the $5.5 million recorded in the previous year. Revenue from EQ’s data platform, LOCUS, is expected to increase by over 388% from the previous year as the Company continued to provide clients with customized data solutions, information and insights. These data empower businesses to make better decisions through multiple online and offline channels.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"About EQ Works","nodeType":"text"},{"data":{},"marks":[],"value":"\nEQ Works (www.eqworks.com) provides a smarter way to target customers. Using first-party, location-based behaviour signals, advanced data analytics, and proprietary software, EQ creates and targets customized, performance-boosting audience segments. Proprietary algorithms and data generate attribution models that connect consumer behavior in the physical world to consumer behavior in the digital world, solving complex challenges for brands and agencies.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[],"nodeType":"hr"},{"data":{},"content":[{"data":{},"marks":[],"value":"Neither the TSX-V nor its Regulation Services Provider (as that term is defined in policies of the TSX-V) accepts responsibility for the adequacy or accuracy of this release.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Forward-Looking Statements","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Certain statements contained in this press release constitute “forward-looking statements”. All statements other than statements of historical fact contained in this press release, including, without limitation, those regarding the Company’s future financial position and results of operations, strategy, plans, objectives, goals and targets, and any statements preceded by, followed by or that include the words “believe”, “expect”, “aim”, “intend”, “plan”, “continue”, “will”, “may”, “would”, “anticipate”, “estimate”, “forecast”, “predict”, “project”, “seek”, “should” or similar expressions or the negative thereof, are forward-looking statements. These statements are not historical facts but instead represent only the Company’s expectations, estimates and projections regarding future events. These statements are not guarantees of future performance and involve assumptions, risks and uncertainties that are difficult to predict. Therefore, actual results may differ materially from what is expressed, implied or forecasted in such forward-looking statements. Additional factors that could cause actual results, performance or achievements to differ materially include, but are not limited to the risk factors discussed in the Company’s MD&A for the three and nine months ended September 30, 2018. Management provides forward-looking statements because it believes they provide useful information to investors when considering their investment objectives and cautions investors not to place undue reliance on forward-looking information. Consequently, all of the forward-looking statements made in this press release are qualified by these cautionary statements and other cautionary statements or factors contained herein, and there can be no assurance that the actual results or developments will be realized or, even if substantially realized, that they will have the expected consequences to, or effects on, the Company. These forward-looking statements are made as of the date of this press release and the Company assumes no obligation to update or revise them to reflect subsequent information, events or circumstances or otherwise, except as required by law.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"For more information, please contact:","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"EQ Inc.\n1235 Bay Street, Suite 401| Toronto, Ontario |M5R 3K4\npress@eqworks.com\nwww.eqworks.com","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}}},"__N_SSG":true}