{"pageProps":{"pressRelease":{"title":"XCHNG Announces New OnXCHNG Partners","excerpt":"Kochava Labs SEZC, a research and development subsidiary of Kochava Inc., announces its second round of strategic partners to participate in OnXCHNG","author":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"2JsF3LAlXsKY4kgyO0pJVO","type":"Entry","createdAt":"2020-08-10T20:26:26.682Z","updatedAt":"2020-08-10T20:26:26.682Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"author"}},"locale":"en-US"},"fields":{"name":"EQ Works"}},"date":"2018-04-19T00:00-04:00","slug":"xchng-announces-new-onxchng-partners","categories":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"nph7if1oawhd"}},"id":"4cuZTcGorM9T6djiI3JQ8l","type":"Entry","createdAt":"2020-09-03T15:00:43.647Z","updatedAt":"2020-09-03T15:00:43.647Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"category"}},"locale":"en-US"},"fields":{"title":"Press Release"}}],"content":{"nodeType":"document","data":{},"content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"GRAND CAYMAN, Cayman Islands, April 19, 2018 /CNW/ -- Kochava Labs SEZC, a research and development subsidiary of Kochava Inc., announces its second round of strategic partners to participate in OnXCHNG, the partnership program for the industry's open source blockchain framework for the digital advertising ecosystem, ","marks":[],"data":{}},{"nodeType":"hyperlink","content":[{"nodeType":"text","value":"XCHNG","marks":[],"data":{}}],"data":{"uri":"https://www.xchng.io/"}},{"nodeType":"text","value":". New OnXCHNG partners include supply-side exchanges, mediation and networks, PeerStream, Inc. (OTCQB: PEER), Receptiv, EQ Works (TSXV: EQ), FeedMob, Heart Media, Instal, Zedge, Sulvo, and Mobidays. Data provider, Datastream Group, Inc., is also now part of the ","marks":[],"data":{}},{"nodeType":"hyperlink","content":[{"nodeType":"text","value":"OnXCHNG","marks":[],"data":{}}],"data":{"uri":"https://www.xchng.io/on-xchng/"}},{"nodeType":"text","value":" Partner Program.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Kochava CEO Charles Manning, said, \"We are thrilled about the growing participation and buy-in from industry partners. OnXCHNG partner participation is crucial for us as we fulfill our vision of building a unified framework for digital advertising on the blockchain. While almost every industry vertical is excited about blockchain's potential, brands and advertisers are most interested in the applicability of blockchain to digital advertising. More importantly, they want to know whether blockchain will address some of the most pressing issues facing the industry today, including brand safety, fraud, and lack of transparency. With XCHNG, we have the potential to shift the paradigm and deliver on the operational value of blockchain for marketers. In the early stages of the project, the emphasis for XCHNG has been to onboard publishers in an effort to build up inventory. In our discussions with advertisers, they are universally enthusiastic about the opportunity to access such a broad range of inventory sources in one place via a standardized, efficient framework.\"","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"XCHNG is being built as a base layer infrastructure for the digital advertising ecosystem and is designed to provide the benefits of blockchain to both buyers and sellers of digital advertising. For all players within the ecosystem, limited changes will be required in order to participate in the advantages of blockchain. By becoming an OnXCHNG partner, publishers and advertisers will be given an opportunity to be directly involved with the protocol's development from the beginning as the infrastructure is completed. Partners will be given access to the codebase so they may be one of the first to build applications on the protocol. They will also be given insight into and influence over the development roadmap and other incentives.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"XCHNG leverages smart contract technology and enables market-driven payment providers to facilitate escrow, fiat conversion, or payment depending on the needs of the participants in an insertion order (IO). The digitization and tokenization of IOs will thereby treat digital ads as a true asset class. During the ","marks":[],"data":{}},{"nodeType":"hyperlink","content":[{"nodeType":"text","value":"Kochava Mobile Summit","marks":[],"data":{}}],"data":{"uri":"https://www.kochava.com/mobile-summit/"}},{"nodeType":"text","value":" in February, attendees witnessed a live demo of XCHNG, which demonstrated the ability to handle 180,000 transactions per smart contract IO. Through a combination of sharding (in which consensus work is split through different branches of the blockchain), side chain architecture, a daily rolling chain, Proof of Stake, and other innovative technologies, this live test translates to millions of digital ads serviced per second, making XCHNG one of the fastest blockchain protocols in existence.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"\"Brands and advertisers across the board have very serious concerns that need to be addressed. Recently, the Wall Street Journal reported that PG&E, the world's largest advertiser, had cut approximately $200 million in digital ad spending in 2017, partly because data showed a large portion of their ad spend was wasted. The same article stated that advertisers are disappointed in publishers' ability to deliver what they promise, and have taken to policing their ad placements themselves,\" Manning continued. \"It's been a challenge for the industry to find a solution that will improve the ecosystem as a whole. The XCHNG platform is centered around the next generation insertion order. Along with the benefits of transparency and security that comes with blockchain technology, we want to create a space where advertisers can receive a trustworthy record of placement and service of their ads.\"","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Since its inception in 2011, Kochava Inc. has aimed to better understand the feedback loop between user acquisition, engagement, and lifetime value throughout the digital ecosystem. Their clientele includes the world's top advertisers and Fortune 100 companies, which depend on Kochava to measure over $6 billion in ad spend annually. Through their industry-leading technology, Kochava sheds light on the effectiveness of ad spend on all connected devices and is uniquely positioned to deliver this blockchain solution to the industry.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"For more information about XCHNG visit ","marks":[],"data":{}},{"nodeType":"hyperlink","content":[{"nodeType":"text","value":"https://www.xchng.io/","marks":[],"data":{}}],"data":{"uri":"https://www.xchng.io/"}},{"nodeType":"text","value":".","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Kochava CEO Charles Manning is available for interview","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"About XCHNG\n","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":"XCHNG is an open and unified blockchain-based framework for the digital advertising ecosystem. Designed and deployed by Kochava Labs SEZC, a research and development subsidiary of Kochava Inc., the XCHNG framework is centered around a common Ricardian Smart Contract with an open blockchain implementation to persist transactional history and provide supporting utilities required for maximizing efficiency through the lifecycle of the IO. XCHNG enables the related targeting and activation of audiences, bolsters ad-spend efficiency and transparency, establishes a next-generation system of record for all participants, and provides the opportunity to tokenize the framework to treat digital as a true asset class, standardizing the valuation of ads. For more information, visit ","marks":[],"data":{}},{"nodeType":"hyperlink","content":[{"nodeType":"text","value":"https://xchng.io/","marks":[],"data":{}}],"data":{"uri":"https://xchng.io/"}},{"nodeType":"text","value":".","marks":[],"data":{}}],"data":{}}]}}},"__N_SSG":true}